{"id": "2510.17392", "categories": ["cs.NE", "cs.AR"], "pdf": "https://arxiv.org/pdf/2510.17392", "abs": "https://arxiv.org/abs/2510.17392", "authors": ["Sonu Kumar", "Arjun S. Nair", "Bhawna Chaudhary", "Mukul Lokhande", "Santosh Kumar Vishvakarma"], "title": "ReLACE: A Resource-Efficient Low-Latency Cortical Acceleration Engine", "comment": null, "summary": "We present a Cortical Neural Pool (CNP) architecture featuring a high-speed,\nresource-efficient CORDIC-based Hodgkin Huxley (RCHH) neuron model. Unlike\nshared CORDIC-based DNN approaches, the proposed neuron leverages modular and\nperformance-optimised CORDIC stages with a latency-area trade-off. The FPGA\nimplementation of the RCHH neuron shows 24.5% LUT reduction and 35.2% improved\nspeed, compared to SoTA designs, with 70% better normalised root mean square\nerror (NRMSE). Furthermore, the CNP exhibits 2.85x higher throughput (12.69\nGOPS) compared to a functionally equivalent CORDIC-based DNN engine, with only\na 0.35% accuracy drop compared to the DNN counterpart on the MNIST dataset. The\noverall results indicate that the design shows biologically accurate,\nlow-resource spiking neural network implementations for resource-constrained\nedge AI applications."}
{"id": "2510.17745", "categories": ["cs.NE", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.17745", "abs": "https://arxiv.org/abs/2510.17745", "authors": ["Lars Niedermeier", "Vyom Shah", "Jeffrey L. Krichmar"], "title": "A Multi-Threading Kernel for Enabling Neuromorphic Edge Applications", "comment": "Submitted to ISCAS 2026", "summary": "Spiking Neural Networks (SNNs) have sparse, event driven processing that can\nleverage neuromorphic applications. In this work, we introduce a\nmulti-threading kernel that enables neuromorphic applications running at the\nedge, meaning they process sensory input directly and without any up-link to or\ndependency on a cloud service. The kernel shows speed-up gains over single\nthread processing by a factor of four on moderately sized SNNs and 1.7X on a\nSynfire network. Furthermore, it load-balances all cores available on\nmulti-core processors, such as ARM, which run today's mobile devices and is up\nto 70% more energy efficient compared to statical core assignment. The present\nwork can enable the development of edge applications that have low Size,\nWeight, and Power (SWaP), and can prototype the integration of neuromorphic\nchips."}
{"id": "2510.17347", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.17347", "abs": "https://arxiv.org/abs/2510.17347", "authors": ["Jingqian Wu", "Shengpeng Xu", "Yunbo Jia", "Edmund Y. Lam"], "title": "Exploring The Missing Semantics In Event Modality", "comment": null, "summary": "Event cameras offer distinct advantages such as low latency, high dynamic\nrange, and efficient motion capture. However, event-to-video reconstruction\n(E2V), a fundamental event-based vision task, remains challenging, particularly\nfor reconstructing and recovering semantic information. This is primarily due\nto the nature of the event camera, as it only captures intensity changes,\nignoring static objects and backgrounds, resulting in a lack of semantic\ninformation in captured event modality. Further, semantic information plays a\ncrucial role in video and frame reconstruction, yet is often overlooked by\nexisting E2V approaches. To bridge this gap, we propose Semantic-E2VID, an E2V\nframework that explores the missing visual semantic knowledge in event modality\nand leverages it to enhance event-to-video reconstruction. Specifically,\nSemantic-E2VID introduces a cross-modal feature alignment (CFA) module to\ntransfer the robust visual semantics from a frame-based vision foundation\nmodel, the Segment Anything Model (SAM), to the event encoder, while aligning\nthe high-level features from distinct modalities. To better utilize the learned\nsemantic feature, we further propose a semantic-aware feature fusion (SFF)\nblock to integrate learned semantics in frame modality to form event\nrepresentations with rich semantics that can be decoded by the event decoder.\nFurther, to facilitate the reconstruction of semantic information, we propose a\nnovel Semantic Perceptual E2V Supervision that helps the model to reconstruct\nsemantic details by leveraging SAM-generated categorical labels. Extensive\nexperiments demonstrate that Semantic-E2VID significantly enhances frame\nquality, outperforming state-of-the-art E2V methods across multiple benchmarks.\nThe sample code is included in the supplementary material."}
{"id": "2510.17745", "categories": ["cs.NE", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.17745", "abs": "https://arxiv.org/abs/2510.17745", "authors": ["Lars Niedermeier", "Vyom Shah", "Jeffrey L. Krichmar"], "title": "A Multi-Threading Kernel for Enabling Neuromorphic Edge Applications", "comment": "Submitted to ISCAS 2026", "summary": "Spiking Neural Networks (SNNs) have sparse, event driven processing that can\nleverage neuromorphic applications. In this work, we introduce a\nmulti-threading kernel that enables neuromorphic applications running at the\nedge, meaning they process sensory input directly and without any up-link to or\ndependency on a cloud service. The kernel shows speed-up gains over single\nthread processing by a factor of four on moderately sized SNNs and 1.7X on a\nSynfire network. Furthermore, it load-balances all cores available on\nmulti-core processors, such as ARM, which run today's mobile devices and is up\nto 70% more energy efficient compared to statical core assignment. The present\nwork can enable the development of edge applications that have low Size,\nWeight, and Power (SWaP), and can prototype the integration of neuromorphic\nchips."}
