{"id": "2512.15055", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2512.15055", "abs": "https://arxiv.org/abs/2512.15055", "authors": ["Yifei Bian", "Banglei Guan", "Zibin Liu", "Ang Su", "Shiyao Zhu", "Yang Shang", "Qifeng Yu"], "title": "Asynchronous Event Stream Noise Filtering for High-frequency Structure Deformation Measurement", "comment": "13 pages, 12 figures", "summary": "Large-scale structures suffer high-frequency deformations due to complex loads. However, harsh lighting conditions and high equipment costs limit measurement methods based on traditional high-speed cameras. This paper proposes a method to measure high-frequency deformations by exploiting an event camera and LED markers. Firstly, observation noise is filtered based on the characteristics of the event stream generated by LED markers blinking and spatiotemporal correlation. Then, LED markers are extracted from the event stream after differentiating between motion-induced events and events from LED blinking, which enables the extraction of high-speed moving LED markers. Ultimately, high-frequency planar deformations are measured by a monocular event camera. Experimental results confirm the accuracy of our method in measuring high-frequency planar deformations."}
{"id": "2512.14869", "categories": ["cs.NE", "cs.ET", "nlin.AO"], "pdf": "https://arxiv.org/pdf/2512.14869", "abs": "https://arxiv.org/abs/2512.14869", "authors": ["Riley Acker", "Aman Desai", "Garrett Kenyon", "Frank Barrows"], "title": "Autonomous Learning of Attractors for Neuromorphic Computing with Wien Bridge Oscillator Networks", "comment": null, "summary": "We present an oscillatory neuromorphic primitive implemented with networks of coupled Wien bridge oscillators and tunable resistive couplings. Phase relationships between oscillators encode patterns, and a local Hebbian learning rule continuously adapts the couplings, allowing learning and recall to emerge from the same ongoing analog dynamics rather than from separate training and inference phases. Using a Kuramoto-style phase model with an effective energy function, we show that learned phase patterns form attractor states and validate this behavior in simulation and hardware. We further realize a 2-4-2 architecture with a hidden layer of oscillators, whose bipartite visible-hidden coupling allows multiple internal configurations to produce the same visible phase states. When inputs are switched, transient spikes in energy followed by relaxation indicate how the network can reduce surprise by reshaping its energy landscape. These results support coupled oscillator circuits as a hardware platform for energy-based neuromorphic computing with autonomous, continuous learning."}
