{"id": "2510.07432", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2510.07432", "abs": "https://arxiv.org/abs/2510.07432", "authors": ["Penghang Liu", "Elizabeth Fons", "Svitlana Vyetrenko", "Daniel Borrajo", "Vamsi Potluru", "Manuela Veloso"], "title": "TS-Agent: A Time Series Reasoning Agent with Iterative Statistical Insight Gathering", "comment": "NeurIPS 2025 Workshop on Foundations of Reasoning in Language Models", "summary": "Large language models (LLMs) have shown strong abilities in reasoning and\nproblem solving, but recent studies reveal that they still struggle with time\nseries reasoning tasks, where outputs are often affected by hallucination or\nknowledge leakage. In this work we propose TS-Agent, a time series reasoning\nagent that leverages LLMs strictly for what they excel at, i.e., gathering\nevidence and synthesizing it into conclusions through step-by-step reasoning,\nwhile delegating the extraction of statistical and structural information to\ntime series analytical tools. Instead of mapping time series into text tokens,\nimages, or embeddings, our agent interacts with raw numeric sequences through\natomic operators, records outputs in an explicit evidence log, and iteratively\nrefines its reasoning under the guidance of a self-critic and a final quality\ngate. This design avoids multi-modal alignment training, preserves the native\nform of time series, ensures interpretability and verifiability, and mitigates\nknowledge leakage or hallucination. Empirically, we evaluate the agent on\nestablished benchmarks. Our experiments show that TS-Agent achieves performance\ncomparable to state-of-the-art LLMs on understanding benchmarks, and delivers\nsignificant improvements on reasoning tasks, where existing models often rely\non memorization and fail in zero-shot settings."}
{"id": "2510.07489", "categories": ["cs.AI", "cs.CL", "cs.CY", "cs.IR", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.07489", "abs": "https://arxiv.org/abs/2510.07489", "authors": ["Akhil Kumar", "Jianliang Leon Zhao", "Om Dobariya"], "title": "Evaluation of LLMs for Process Model Analysis and Optimization", "comment": "15 pages, 5 tables, 4 figures; full research paper currently under\n  review for the Workshop on Information Technologies and Systems (WITS) 2025.\n  The paper presents a comprehensive evaluation of large language models (LLMs)\n  for business process model analysis and optimization, including error\n  detection, reasoning, and scenario-based redesign", "summary": "In this paper, we report our experience with several LLMs for their ability\nto understand a process model in an interactive, conversational style, find\nsyntactical and logical errors in it, and reason with it in depth through a\nnatural language (NL) interface. Our findings show that a vanilla, untrained\nLLM like ChatGPT (model o3) in a zero-shot setting is effective in\nunderstanding BPMN process models from images and answering queries about them\nintelligently at syntactic, logic, and semantic levels of depth. Further,\ndifferent LLMs vary in performance in terms of their accuracy and\neffectiveness. Nevertheless, our empirical analysis shows that LLMs can play a\nvaluable role as assistants for business process designers and users. We also\nstudy the LLM's \"thought process\" and ability to perform deeper reasoning in\nthe context of process analysis and optimization. We find that the LLMs seem to\nexhibit anthropomorphic properties."}
{"id": "2510.07551", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2510.07551", "abs": "https://arxiv.org/abs/2510.07551", "authors": ["Harshit Rajgarhia", "Suryam Gupta", "Asif Shaik", "Gulipalli Praveen Kumar", "Y Santhoshraj", "Sanka Nithya Tanvy Nishitha", "Abhishek Mukherji"], "title": "An Evaluation Study of Hybrid Methods for Multilingual PII Detection", "comment": null, "summary": "The detection of Personally Identifiable Information (PII) is critical for\nprivacy compliance but remains challenging in low-resource languages due to\nlinguistic diversity and limited annotated data. We present RECAP, a hybrid\nframework that combines deterministic regular expressions with context-aware\nlarge language models (LLMs) for scalable PII detection across 13 low-resource\nlocales. RECAP's modular design supports over 300 entity types without\nretraining, using a three-phase refinement pipeline for disambiguation and\nfiltering. Benchmarked with nervaluate, our system outperforms fine-tuned NER\nmodels by 82% and zero-shot LLMs by 17% in weighted F1-score. This work offers\na scalable and adaptable solution for efficient PII detection in\ncompliance-focused applications."}
{"id": "2510.07546", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.07546", "abs": "https://arxiv.org/abs/2510.07546", "authors": ["Soroush Mehraban", "Vida Adeli", "Jacob Rommann", "Babak Taati", "Kyryl Truskovskyi"], "title": "PickStyle: Video-to-Video Style Transfer with Context-Style Adapters", "comment": null, "summary": "We address the task of video style transfer with diffusion models, where the\ngoal is to preserve the context of an input video while rendering it in a\ntarget style specified by a text prompt. A major challenge is the lack of\npaired video data for supervision. We propose PickStyle, a video-to-video style\ntransfer framework that augments pretrained video diffusion backbones with\nstyle adapters and benefits from paired still image data with source-style\ncorrespondences for training. PickStyle inserts low-rank adapters into the\nself-attention layers of conditioning modules, enabling efficient\nspecialization for motion-style transfer while maintaining strong alignment\nbetween video content and style. To bridge the gap between static image\nsupervision and dynamic video, we construct synthetic training clips from\npaired images by applying shared augmentations that simulate camera motion,\nensuring temporal priors are preserved. In addition, we introduce Context-Style\nClassifier-Free Guidance (CS-CFG), a novel factorization of classifier-free\nguidance into independent text (style) and video (context) directions. CS-CFG\nensures that context is preserved in generated video while the style is\neffectively transferred. Experiments across benchmarks show that our approach\nachieves temporally coherent, style-faithful, and content-preserving video\ntranslations, outperforming existing baselines both qualitatively and\nquantitatively."}
{"id": "2510.07632", "categories": ["cs.AI", "cs.CL", "cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.07632", "abs": "https://arxiv.org/abs/2510.07632", "authors": ["Yinglun Zhu", "Jiancheng Zhang", "Fuzhi Tang"], "title": "Test-Time Matching: Unlocking Compositional Reasoning in Multimodal Models", "comment": null, "summary": "Frontier AI models have achieved remarkable progress, yet recent studies\nsuggest they struggle with compositional reasoning, often performing at or\nbelow random chance on established benchmarks. We revisit this problem and show\nthat widely used evaluation metrics systematically underestimate model\ncapability. To address this, we introduce a group matching score that better\nexploits group structure and reveals substantial hidden capability in both\ncontrastive vision-language models (VLMs) and multimodal large language models\n(MLLMs). Moreover, simply overfitting to the induced group matchings at test\ntime transfers this hidden capability into higher scores under standard\nevaluation metrics, closing much of the reported gap. This adjustment enables\nSigLIP-B16 to surpass all previous results and GPT-4.1 to yield the first\nresult surpassing estimated human performance on Winoground.\n  Building on this insight, we propose Test-Time Matching (TTM), an iterative,\nself-improving algorithm that further bootstraps model performance without any\nexternal supervision. TTM delivers additional, non-trivial improvements: for\nexample, TTM enables SigLIP-B16 to surpass GPT-4.1 on MMVP-VLM, establishing a\nnew state of the art. Importantly, TTM remains broadly effective even on\nbenchmarks without metric-induced effects or group structures, achieving\nrelative gains up to 85.7% on challenging datasets such as WhatsUp. Across 16\ndataset variants spanning diverse setups, our experiments demonstrate that TTM\nconsistently improves model performance and advances the frontier of\ncompositional reasoning."}
{"id": "2510.07550", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.07550", "abs": "https://arxiv.org/abs/2510.07550", "authors": ["Saman Motamed", "Minghao Chen", "Luc Van Gool", "Iro Laina"], "title": "TRAVL: A Recipe for Making Video-Language Models Better Judges of Physics Implausibility", "comment": null, "summary": "Despite impressive visual fidelity, modern video generative models frequently\nproduce sequences that violate intuitive physical laws, such as objects\nfloating, teleporting, or morphing in ways that defy causality. While humans\ncan easily detect such implausibilities, there remains no robust method for\nquantitatively assessing physical realism in video. In this work, we explore\nwhether Video-Language Models (VLMs) can be trained to serve as reliable judges\nof physical plausibility. We find that existing VLMs struggle to identify\nphysics violations, exposing fundamental limitations in their temporal and\ncausal reasoning. To address this, we introduce TRAVL, a fine-tuning recipe\nthat combines a balanced training dataset with a trajectory-aware attention\nmodule to improve motion encoding and discrimination in VLMs. To evaluate\nphysical reasoning more rigorously, we propose ImplausiBench, a benchmark of\n300 videos (150 real, 150 generated) that removes linguistic biases and\nisolates visual-temporal understanding. Performance is reported both with\ngold-standard human judgments and stricter LLM-as-judge metrics. Together,\nTRAVL and ImplausiBench offer a unified framework for probing and improving\nphysical plausibility in multimodal models, shedding light on a challenging and\nunderexplored aspect of visual-temporal understanding."}
{"id": "2510.07545", "categories": ["cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.07545", "abs": "https://arxiv.org/abs/2510.07545", "authors": ["Md Tahmid Rahman Laskar", "Mohammed Saidul Islam", "Ridwan Mahbub", "Mizanur Rahman", "Amran Bhuiyan", "Israt Jahan", "Mir Tafseer Nayeem", "Shafiq Joty", "Enamul Hoque", "Jimmy Huang"], "title": "Deploying Tiny LVLM Judges for Real-World Evaluation of Chart Models: Lessons Learned and Best Practices", "comment": "Accepted to the EMNLP 2025 Industry Track", "summary": "Large Vision-Language Models (LVLMs) with only 7B parameters have shown\npromise as automated judges in chart comprehension tasks. However, tiny models\n(<=2B parameters) still perform poorly as judges, limiting their real-world use\nin resource-constrained settings. To address this, we propose two approaches to\nensure cost-efficient evaluation: (i) multi-criteria prompting, which combines\nseparate evaluation criteria into a single query, and (ii) domain-adaptive\ntransfer learning, in which we fine-tune a 2B-parameter LVLM on synthetic\njudgments in a chart dataset to create the ChartJudge. Experiments show that\nmulti-criteria prompting exposes robustness gaps, which led to a huge drop in\nperformance for 7B models, including specialized LVLM judges like LLaVA-Critic.\nIn addition, we find that our tiny LVLM (ChartJudge) can effectively transfer\nknowledge from one dataset to another to make it a more specialized model. Our\nfine-grained analysis across chart types and query complexities offers\nactionable insights into trade-offs between model size, prompt design, and\ntransferability, enabling scalable, low-cost evaluation for chart reasoning\ntasks. Our code and the data will be made publicly available."}
{"id": "2510.07709", "categories": ["cs.AI", "cs.CL", "cs.CY", "cs.MA"], "pdf": "https://arxiv.org/pdf/2510.07709", "abs": "https://arxiv.org/abs/2510.07709", "authors": ["Alhim Vera", "Karen Sanchez", "Carlos Hinojosa", "Haidar Bin Hamid", "Donghoon Kim", "Bernard Ghanem"], "title": "Multimodal Safety Evaluation in Generative Agent Social Simulations", "comment": null, "summary": "Can generative agents be trusted in multimodal environments? Despite advances\nin large language and vision-language models that enable agents to act\nautonomously and pursue goals in rich settings, their ability to reason about\nsafety, coherence, and trust across modalities remains limited. We introduce a\nreproducible simulation framework for evaluating agents along three dimensions:\n(1) safety improvement over time, including iterative plan revisions in\ntext-visual scenarios; (2) detection of unsafe activities across multiple\ncategories of social situations; and (3) social dynamics, measured as\ninteraction counts and acceptance ratios of social exchanges. Agents are\nequipped with layered memory, dynamic planning, multimodal perception, and are\ninstrumented with SocialMetrics, a suite of behavioral and structural metrics\nthat quantifies plan revisions, unsafe-to-safe conversions, and information\ndiffusion across networks. Experiments show that while agents can detect direct\nmultimodal contradictions, they often fail to align local revisions with global\nsafety, reaching only a 55 percent success rate in correcting unsafe plans.\nAcross eight simulation runs with three models - Claude, GPT-4o mini, and\nQwen-VL - five agents achieved average unsafe-to-safe conversion rates of 75,\n55, and 58 percent, respectively. Overall performance ranged from 20 percent in\nmulti-risk scenarios with GPT-4o mini to 98 percent in localized contexts such\nas fire/heat with Claude. Notably, 45 percent of unsafe actions were accepted\nwhen paired with misleading visuals, showing a strong tendency to overtrust\nimages. These findings expose critical limitations in current architectures and\nprovide a reproducible platform for studying multimodal safety, coherence, and\nsocial dynamics."}
{"id": "2510.07556", "categories": ["cs.CV", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.07556", "abs": "https://arxiv.org/abs/2510.07556", "authors": ["Rafin Hassan", "Zarin Tasnim Roshni", "Rafiqul Bari", "Alimul Islam", "Nabeel Mohammed", "Moshiur Farazi", "Shafin Rahman"], "title": "Label Semantics for Robust Hyperspectral Image Classification", "comment": "This work has been accepted for publication in the proceedings of\n  IJCNN 2025", "summary": "Hyperspectral imaging (HSI) classification is a critical tool with widespread\napplications across diverse fields such as agriculture, environmental\nmonitoring, medicine, and materials science. Due to the limited availability of\nhigh-quality training samples and the high dimensionality of spectral data, HSI\nclassification models are prone to overfitting and often face challenges in\nbalancing accuracy and computational complexity. Furthermore, most of HSI\nclassification models are monomodal, where it solely relies on spectral-spatial\ndata to learn decision boundaries in the high dimensional embedding space. To\naddress this, we propose a general-purpose Semantic Spectral-Spatial Fusion\nNetwork (S3FN) that uses contextual, class specific textual descriptions to\ncomplement the training of an HSI classification model. Specifically, S3FN\nleverages LLMs to generate comprehensive textual descriptions for each class\nlabel that captures their unique characteristics and spectral behaviors. These\ndescriptions are then embedded into a vector space using a pre-trained text\nencoder such as BERT or RoBERTa to extract meaningful label semantics which in\nturn leads to a better feature-label alignment for improved classification\nperformance. To demonstrate the effectiveness of our approach, we evaluate our\nmodel on three diverse HSI benchmark datasets - Hyperspectral Wood,\nHyperspectralBlueberries, and DeepHS-Fruit and report significant performance\nboost. Our results highlight the synergy between textual semantics and\nspectral-spatial data, paving the way for further advancements in semantically\naugmented HSI classification models. Codes are be available in:\nhttps://github.com/milab-nsu/S3FN"}
{"id": "2510.07737", "categories": ["cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.07737", "abs": "https://arxiv.org/abs/2510.07737", "authors": ["Fu Chen", "Peng Wang", "Xiyin Li", "Wen Li", "Shichi Lei", "Dongdong Xiang"], "title": "ToolExpander: Extending the Frontiers of Tool-Using Reinforcement Learning to Weak LLMs", "comment": null, "summary": "Training Large Language Models (LLMs) with Group Relative Policy Optimization\n(GRPO) encounters a significant challenge: models often fail to produce\naccurate responses, particularly in small-scale architectures. This limitation\nnot only diminishes performance improvements and undermines the potential of\nGRPO but also frequently leads to mid-training collapse, adversely affecting\nstability and final efficacy. To address these issues, we propose ToolExpander,\na novel framework that advances tool-oriented reinforcement learning for\nresource-constrained LLMs through two key innovations:(1) Dynamic Multi-Round\nHard Sampling, which dynamically substitutes challenging samples(those without\ncorrect outputs over 10 rollouts) with high-quality few-shot demonstrations\nduring training, coupled with an exponential learning rate decay strategy to\nmitigate oscillations;(2) Self-Exemplifying Thinking, an enhanced GRPO\nframework that eliminates KL divergence and incorporates adjusted clipping\ncoefficients, encouraging models to autonomously generate and analyze few-shot\nexamples via a minimal additional reward (0.01).Experimental results\ndemonstrate that ToolExpander significantly enhances tool-using capabilities in\nLLMs, especially in weaker small-scale models, improving both training\nstability and overall performance."}
{"id": "2510.07852", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2510.07852", "abs": "https://arxiv.org/abs/2510.07852", "authors": ["Shuangyan Deng", "Haizhou Peng", "Jiachen Xu", "Rui Mao", "Ciprian Doru Giurcăneanu", "Jiamou Liu"], "title": "FinMR: A Knowledge-Intensive Multimodal Benchmark for Advanced Financial Reasoning", "comment": "This paper has been accept by ICAIF 2025", "summary": "Multimodal Large Language Models (MLLMs) have made substantial progress in\nrecent years. However, their rigorous evaluation within specialized domains\nlike finance is hindered by the absence of datasets characterized by\nprofessional-level knowledge intensity, detailed annotations, and advanced\nreasoning complexity. To address this critical gap, we introduce FinMR, a\nhigh-quality, knowledge-intensive multimodal dataset explicitly designed to\nevaluate expert-level financial reasoning capabilities at a professional\nanalyst's standard. FinMR comprises over 3,200 meticulously curated and\nexpertly annotated question-answer pairs across 15 diverse financial topics,\nensuring broad domain diversity and integrating sophisticated mathematical\nreasoning, advanced financial knowledge, and nuanced visual interpretation\ntasks across multiple image types. Through comprehensive benchmarking with\nleading closed-source and open-source MLLMs, we highlight significant\nperformance disparities between these models and professional financial\nanalysts, uncovering key areas for model advancement, such as precise image\nanalysis, accurate application of complex financial formulas, and deeper\ncontextual financial understanding. By providing richly varied visual content\nand thorough explanatory annotations, FinMR establishes itself as an essential\nbenchmark tool for assessing and advancing multimodal financial reasoning\ntoward professional analyst-level competence."}
{"id": "2510.07567", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.07567", "abs": "https://arxiv.org/abs/2510.07567", "authors": ["Karuna Bhaila", "Aneesh Komanduri", "Minh-Hao Van", "Xintao Wu"], "title": "Cross-Modal Attention Guided Unlearning in Vision-Language Models", "comment": null, "summary": "Vision-Language Models (VLMs) have demonstrated immense capabilities in\nmulti-modal understanding and inference tasks such as Visual Question Answering\n(VQA), which requires models to infer outputs based on visual and textual\ncontext simultaneously. Such inference abilities of large-scale pretrained\nmodels are often attributed to the massive scale of pre-training data collected\nacross several domains. However, the models may memorize private and/or\nsensitive information during training and regurgitate it in inference.\nRecently, machine unlearning has been leveraged to address the leakage of\nprivate data in LLMs. VLMs add a layer of complexity to this process, as the\nvisual context in the query may also contain sensitive information in addition\nto the text. To address this issue, we explore unlearning for vision-language\nmodels, specifically for the VQA task. We explore the role of visual tokens for\noutput generation in VLMs using cross-modal attention and utilize it to\nformulate Cross-Modal Attention Guided Unlearning (CAGUL), a lightweight and\nefficient VLM unlearning framework. In contrast to computationally expensive\nmodel finetuning methods, CAGUL utilizes external modules to encode unlearning\ninformation in visual tokens of low importance for relevant queries. We find\nthat the transformed visual tokens not only prevent leakage but also retain\nreference model behavior. Experimental results show that our method performs\nbetter or on par with finetuning-based baselines without altering the\npre-trained model parameters or incurring retraining costs, making it a\npractical and effective unlearning solution for VLMs."}
{"id": "2510.07793", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.07793", "abs": "https://arxiv.org/abs/2510.07793", "authors": ["Sajib Acharjee Dip", "Adrika Zafor", "Bikash Kumar Paul", "Uddip Acharjee Shuvo", "Muhit Islam Emon", "Xuan Wang", "Liqing Zhang"], "title": "LLM4Cell: A Survey of Large Language and Agentic Models for Single-Cell Biology", "comment": "34 pages, 5 figures, 7 tables", "summary": "Large language models (LLMs) and emerging agentic frameworks are beginning to\ntransform single-cell biology by enabling natural-language reasoning,\ngenerative annotation, and multimodal data integration. However, progress\nremains fragmented across data modalities, architectures, and evaluation\nstandards. LLM4Cell presents the first unified survey of 58 foundation and\nagentic models developed for single-cell research, spanning RNA, ATAC,\nmulti-omic, and spatial modalities. We categorize these methods into five\nfamilies-foundation, text-bridge, spatial, multimodal, epigenomic, and\nagentic-and map them to eight key analytical tasks including annotation,\ntrajectory and perturbation modeling, and drug-response prediction. Drawing on\nover 40 public datasets, we analyze benchmark suitability, data diversity, and\nethical or scalability constraints, and evaluate models across 10 domain\ndimensions covering biological grounding, multi-omics alignment, fairness,\nprivacy, and explainability. By linking datasets, models, and evaluation\ndomains, LLM4Cell provides the first integrated view of language-driven\nsingle-cell intelligence and outlines open challenges in interpretability,\nstandardization, and trustworthy model development."}
{"id": "2510.07858", "categories": ["cs.AI", "cs.LG", "62M10", "I.2.7"], "pdf": "https://arxiv.org/pdf/2510.07858", "abs": "https://arxiv.org/abs/2510.07858", "authors": ["Zhiqing Cui", "Binwu Wang", "Qingxiang Liu", "Yeqiang Wang", "Zhengyang Zhou", "Yuxuan Liang", "Yang Wang"], "title": "Augur: Modeling Covariate Causal Associations in Time Series via Large Language Models", "comment": "22 pages, 9 figures", "summary": "Large language models (LLM) have emerged as a promising avenue for time\nseries forecasting, offering the potential to integrate multimodal data.\nHowever, existing LLM-based approaches face notable limitations-such as\nmarginalized role in model architectures, reliance on coarse statistical text\nprompts, and lack of interpretability. In this work, we introduce Augur, a\nfully LLM driven time series forecasting framework that exploits LLM causal\nreasoning to discover and use directed causal associations among covariates.\nAugur uses a two stage teacher student architecture where a powerful teacher\nLLM infers a directed causal graph from time series using heuristic search\ntogether with pairwise causality testing. A lightweight student agent then\nrefines the graph and fine tune on high confidence causal associations that are\nencoded as rich textual prompts to perform forecasting. This design improves\npredictive accuracy while yielding transparent, traceable reasoning about\nvariable interactions. Extensive experiments on real-world datasets with 25\nbaselines demonstrate that Augur achieves competitive performance and robust\nzero-shot generalization."}
{"id": "2510.07631", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.07631", "abs": "https://arxiv.org/abs/2510.07631", "authors": ["Shreshth Saini", "Shashank Gupta", "Alan C. Bovik"], "title": "Rectified-CFG++ for Flow Based Models", "comment": "Accepted at NeurIPS 2025", "summary": "Classifier-free guidance (CFG) is the workhorse for steering large diffusion\nmodels toward text-conditioned targets, yet its native application to rectified\nflow (RF) based models provokes severe off-manifold drift, yielding visual\nartifacts, text misalignment, and brittle behaviour. We present\nRectified-CFG++, an adaptive predictor-corrector guidance that couples the\ndeterministic efficiency of rectified flows with a geometry-aware conditioning\nrule. Each inference step first executes a conditional RF update that anchors\nthe sample near the learned transport path, then applies a weighted conditional\ncorrection that interpolates between conditional and unconditional velocity\nfields. We prove that the resulting velocity field is marginally consistent and\nthat its trajectories remain within a bounded tubular neighbourhood of the data\nmanifold, ensuring stability across a wide range of guidance strengths.\nExtensive experiments on large-scale text-to-image models (Flux, Stable\nDiffusion 3/3.5, Lumina) show that Rectified-CFG++ consistently outperforms\nstandard CFG on benchmark datasets such as MS-COCO, LAION-Aesthetic, and\nT2I-CompBench. Project page: https://rectified-cfgpp.github.io/"}
{"id": "2510.07881", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2510.07881", "abs": "https://arxiv.org/abs/2510.07881", "authors": ["Heyang Liu", "Yuhao Wang", "Ziyang Cheng", "Ronghua Wu", "Qunshan Gu", "Yanfeng Wang", "Yu Wang"], "title": "CS3-Bench: Evaluating and Enhancing Speech-to-Speech LLMs for Mandarin-English Code-Switching", "comment": null, "summary": "The advancement of multimodal large language models has accelerated the\ndevelopment of speech-to-speech interaction systems. While natural monolingual\ninteraction has been achieved, we find existing models exhibit deficiencies in\nlanguage alignment. In our proposed Code-Switching Speech-to-Speech Benchmark\n(CS3-Bench), experiments on 7 mainstream models demonstrate a relative\nperformance drop of up to 66% in knowledge-intensive question answering and\nvarying degrees of misunderstanding in open-ended conversations. Starting from\na model with severe performance deterioration, we propose both data\nconstructions and training approaches to improve the language alignment\ncapabilities, specifically employing Chain of Recognition (CoR) to enhance\nunderstanding and Keyword Highlighting (KH) to guide generation. Our approach\nimproves the knowledge accuracy from 25.14% to 46.13%, with open-ended\nunderstanding rate from 64.5% to 86.5%, and significantly reduces pronunciation\nerrors in the secondary language. CS3-Bench is available at\nhttps://huggingface.co/datasets/VocalNet/CS3-Bench."}
{"id": "2510.08238", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2510.08238", "abs": "https://arxiv.org/abs/2510.08238", "authors": ["Jiyang Qiu", "Xinbei Ma", "Yunqing Xu", "Zhuosheng Zhang", "Hai Zhao"], "title": "Chain-of-Trigger: An Agentic Backdoor that Paradoxically Enhances Agentic Robustness", "comment": null, "summary": "The rapid deployment of large language model (LLM)-based agents in real-world\napplications has raised serious concerns about their trustworthiness. In this\nwork, we reveal the security and robustness vulnerabilities of these agents\nthrough backdoor attacks. Distinct from traditional backdoors limited to\nsingle-step control, we propose the Chain-of-Trigger Backdoor (CoTri), a\nmulti-step backdoor attack designed for long-horizon agentic control. CoTri\nrelies on an ordered sequence. It starts with an initial trigger, and\nsubsequent ones are drawn from the environment, allowing multi-step\nmanipulation that diverts the agent from its intended task. Experimental\nresults show that CoTri achieves a near-perfect attack success rate (ASR) while\nmaintaining a near-zero false trigger rate (FTR). Due to training data modeling\nthe stochastic nature of the environment, the implantation of CoTri\nparadoxically enhances the agent's performance on benign tasks and even\nimproves its robustness against environmental distractions. We further validate\nCoTri on vision-language models (VLMs), confirming its scalability to\nmultimodal agents. Our work highlights that CoTri achieves stable, multi-step\ncontrol within agents, improving their inherent robustness and task\ncapabilities, which ultimately makes the attack more stealthy and raises\npotential safty risks."}
{"id": "2510.07636", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.07636", "abs": "https://arxiv.org/abs/2510.07636", "authors": ["Shashank Gupta", "Gregoire Phillips", "Alan C. Bovik"], "title": "PIT-QMM: A Large Multimodal Model For No-Reference Point Cloud Quality Assessment", "comment": "Oral presentation at ICIP 2025", "summary": "Large Multimodal Models (LMMs) have recently enabled considerable advances in\nthe realm of image and video quality assessment, but this progress has yet to\nbe fully explored in the domain of 3D assets. We are interested in using these\nmodels to conduct No-Reference Point Cloud Quality Assessment (NR-PCQA), where\nthe aim is to automatically evaluate the perceptual quality of a point cloud in\nabsence of a reference. We begin with the observation that different modalities\nof data - text descriptions, 2D projections, and 3D point cloud views - provide\ncomplementary information about point cloud quality. We then construct PIT-QMM,\na novel LMM for NR-PCQA that is capable of consuming text, images and point\nclouds end-to-end to predict quality scores. Extensive experimentation shows\nthat our proposed method outperforms the state-of-the-art by significant\nmargins on popular benchmarks with fewer training iterations. We also\ndemonstrate that our framework enables distortion localization and\nidentification, which paves a new way forward for model explainability and\ninteractivity. Code and datasets are available at\nhttps://www.github.com/shngt/pit-qmm."}
{"id": "2510.07931", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2510.07931", "abs": "https://arxiv.org/abs/2510.07931", "authors": ["Madis Jürviste", "Joonatan Jakobson"], "title": "Vision-Enabled LLMs in Historical Lexicography: Digitising and Enriching Estonian-German Dictionaries from the 17th and 18th Centuries", "comment": null, "summary": "This article presents research conducted at the Institute of the Estonian\nLanguage between 2022 and 2025 on the application of large language models\n(LLMs) to the study of 17th and 18th century Estonian dictionaries. The authors\naddress three main areas: enriching historical dictionaries with modern word\nforms and meanings; using vision-enabled LLMs to perform text recognition on\nsources printed in Gothic script (Fraktur); and preparing for the creation of a\nunified, cross-source dataset. Initial experiments with J. Gutslaff's 1648\ndictionary indicate that LLMs have significant potential for semi-automatic\nenrichment of dictionary information. When provided with sufficient context,\nClaude 3.7 Sonnet accurately provided meanings and modern equivalents for 81%\nof headword entries. In a text recognition experiment with A. T. Helle's 1732\ndictionary, a zero-shot method successfully identified and structured 41% of\nheadword entries into error-free JSON-formatted output. For digitising the\nEstonian-German dictionary section of A. W. Hupel's 1780 grammar, overlapping\ntiling of scanned image files is employed, with one LLM being used for text\nrecognition and a second for merging the structured output. These findings\ndemonstrate that even for minor languages LLMs have a significant potential for\nsaving time and financial resources."}
{"id": "2510.08470", "categories": ["cs.AI", "cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.08470", "abs": "https://arxiv.org/abs/2510.08470", "authors": ["Bianca-Mihaela Ganescu", "Suchir Salhan", "Andrew Caines", "Paula Buttery"], "title": "Looking to Learn: Token-wise Dynamic Gating for Low-Resource Vision-Language Modelling", "comment": "Accepted to the EMNLP 2025 BabyLM Workshop", "summary": "Training vision-language models on cognitively-plausible amounts of data\nrequires rethinking how models integrate multimodal information. Within the\nconstraints of the Vision track for the BabyLM Challenge 2025, we propose a\nlightweight decoder-based architecture with (1) token-wise dynamic gating for\nadaptive fusion of linguistic and visual cues, (2) feature modulation and\nchannel attention to maximise the utility of limited visual information and (3)\nauxiliary contrastive objectives for visual grounding. Evaluation on five\nbenchmarks (BLiMP, BLiMP Supplement, EWoK, Winoground and VQA) shows\ncompetitive or superior performance to multimodal baselines. More notably, our\ndynamic gate discovers interpretable patterns without explicit supervision,\nfavouring visual cues for content words and linguistic cues for function words.\nWhile we identify limitations in the Challenge constraints, such as the\ninformation bottleneck created by global image embeddings and training\ninstability from the dataset split, our findings establish dynamic gating as a\npowerful tool for efficient multimodal learning, offering both interpretability\nand performance even under severe constraints."}
{"id": "2510.07703", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.07703", "abs": "https://arxiv.org/abs/2510.07703", "authors": ["Xiaoxu Ma", "Runhao Li", "Zhenyu Weng"], "title": "Mutual Learning for Hashing: Unlocking Strong Hash Functions from Weak Supervision", "comment": null, "summary": "Deep hashing has been widely adopted for large-scale image retrieval, with\nnumerous strategies proposed to optimize hash function learning. Pairwise-based\nmethods are effective in learning hash functions that preserve local similarity\nrelationships, whereas center-based methods typically achieve superior\nperformance by more effectively capturing global data distributions. However,\nthe strength of center-based methods in modeling global structures often comes\nat the expense of underutilizing important local similarity information. To\naddress this limitation, we propose Mutual Learning for Hashing (MLH), a novel\nweak-to-strong framework that enhances a center-based hashing branch by\ntransferring knowledge from a weaker pairwise-based branch. MLH consists of two\nbranches: a strong center-based branch and a weaker pairwise-based branch.\nThrough an iterative mutual learning process, the center-based branch leverages\nlocal similarity cues learned by the pairwise-based branch. Furthermore,\ninspired by the mixture-of-experts paradigm, we introduce a novel\nmixture-of-hash-experts module that enables effective cross-branch interaction,\nfurther enhancing the performance of both branches. Extensive experiments\ndemonstrate that MLH consistently outperforms state-of-the-art hashing methods\nacross multiple benchmark datasets."}
{"id": "2510.07993", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.07993", "abs": "https://arxiv.org/abs/2510.07993", "authors": ["Watcharapong Timklaypachara", "Monrada Chiewhawan", "Nopporn Lekuthai", "Titipat Achakulvisut"], "title": "Leveraging Author-Specific Context for Scientific Figure Caption Generation: 3rd SciCap Challenge", "comment": null, "summary": "Scientific figure captions require both accuracy and stylistic consistency to\nconvey visual information. Here, we present a domain-specific caption\ngeneration system for the 3rd SciCap Challenge that integrates figure-related\ntextual context with author-specific writing styles using the LaMP-Cap dataset.\nOur approach uses a two-stage pipeline: Stage 1 combines context filtering,\ncategory-specific prompt optimization via DSPy's MIPROv2 and SIMBA, and caption\ncandidate selection; Stage 2 applies few-shot prompting with profile figures\nfor stylistic refinement. Our experiments demonstrate that category-specific\nprompts outperform both zero-shot and general optimized approaches, improving\nROUGE-1 recall by +8.3\\% while limiting precision loss to -2.8\\% and BLEU-4\nreduction to -10.9\\%. Profile-informed stylistic refinement yields 40--48\\%\ngains in BLEU scores and 25--27\\% in ROUGE. Overall, our system demonstrates\nthat combining contextual understanding with author-specific stylistic\nadaptation can generate captions that are both scientifically accurate and\nstylistically faithful to the source paper."}
{"id": "2510.08564", "categories": ["cs.AI", "cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.08564", "abs": "https://arxiv.org/abs/2510.08564", "authors": ["Zhen Zhu", "Yiming Gong", "Yao Xiao", "Yaoyao Liu", "Derek Hoiem"], "title": "How to Teach Large Multimodal Models New Skills", "comment": "In submission. Code is available at\n  https://github.com/jessemelpolio/LMM_CL", "summary": "How can we teach large multimodal models (LMMs) new skills without erasing\nprior abilities? We study sequential fine-tuning on five target skills while\nmonitoring general ability on eight held-out benchmarks across three model\nfamilies. We observe that apparent \"forgetting\" on held-out tasks after narrow\nfine-tuning can partly recover at later stages. We trace this behavior to a\nmeasurable shift in the output token distribution, manifested through a simple\ncounting-bias probe that co-varies with forgetting. Guided by this picture, we\nidentify two simple, robust tuning recipes that learn strongly while limiting\ndrift: (i) updating only the self-attention projection layers, and (ii)\nupdating only the MLP Gate&Up while freezing the Down projection. Across models\nand tasks, these choices deliver strong target gains while largely preserving\nheld-out performance. Code is available at\nhttps://github.com/jessemelpolio/LMM_CL"}
{"id": "2510.07791", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.07791", "abs": "https://arxiv.org/abs/2510.07791", "authors": ["Qinghongbing Xie", "Zhaoyuan Xia", "Feng Zhu", "Lijun Gong", "Ziyue Li", "Rui Zhao", "Long Zeng"], "title": "GTR-Bench: Evaluating Geo-Temporal Reasoning in Vision-Language Models", "comment": "20 pages, 13 figures", "summary": "Recently spatial-temporal intelligence of Visual-Language Models (VLMs) has\nattracted much attention due to its importance for Autonomous Driving, Embodied\nAI and General Artificial Intelligence. Existing spatial-temporal benchmarks\nmainly focus on egocentric perspective reasoning with images/video context, or\ngeographic perspective reasoning with graphics context (eg. a map), thus fail\nto assess VLMs' geographic spatial-temporal intelligence with both images/video\nand graphics context, which is important for areas like traffic management and\nemergency response. To address the gaps, we introduce Geo-Temporal Reasoning\nbenchmark (GTR-Bench), a novel challenge for geographic temporal reasoning of\nmoving targets in a large-scale camera network. GTR-Bench is more challenging\nas it requires multiple perspective switches between maps and videos, joint\nreasoning across multiple videos with non-overlapping fields of view, and\ninference over spatial-temporal regions that are unobserved by any video\ncontext. Evaluations of more than 10 popular VLMs on GTR-Bench demonstrate that\neven the best proprietary model, Gemini-2.5-Pro (34.9%), significantly lags\nbehind human performance (78.61%) on geo-temporal reasoning. Moreover, our\ncomprehensive analysis on GTR-Bench reveals three primary deficiencies of\ncurrent models for geo-temporal reasoning. (1) VLMs' reasoning is impaired by\nan imbalanced utilization of spatial-temporal context. (2) VLMs are weak in\ntemporal forecasting, which leads to worse performance on temporal-emphasized\ntasks than on spatial-emphasized tasks. (3) VLMs lack the proficiency to\ncomprehend or align the map data with multi-view video inputs. We believe\nGTR-Bench offers valuable insights and opens up new opportunities for research\nand applications in spatial-temporal intelligence. Benchmark and code will be\nreleased at https://github.com/X-Luffy/GTR-Bench."}
{"id": "2510.08002", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.08002", "abs": "https://arxiv.org/abs/2510.08002", "authors": ["Cheng Yang", "Xuemeng Yang", "Licheng Wen", "Daocheng Fu", "Jianbiao Mei", "Rong Wu", "Pinlong Cai", "Yufan Shen", "Nianchen Deng", "Botian Shi", "Yu Qiao", "Haifeng Li"], "title": "Learning on the Job: An Experience-Driven Self-Evolving Agent for Long-Horizon Tasks", "comment": null, "summary": "Large Language Models have demonstrated remarkable capabilities across\ndiverse domains, yet significant challenges persist when deploying them as AI\nagents for real-world long-horizon tasks. Existing LLM agents suffer from a\ncritical limitation: they are test-time static and cannot learn from\nexperience, lacking the ability to accumulate knowledge and continuously\nimprove on the job. To address this challenge, we propose MUSE, a novel agent\nframework that introduces an experience-driven, self-evolving system centered\naround a hierarchical Memory Module. MUSE organizes diverse levels of\nexperience and leverages them to plan and execute long-horizon tasks across\nmultiple applications. After each sub-task execution, the agent autonomously\nreflects on its trajectory, converting the raw trajectory into structured\nexperience and integrating it back into the Memory Module. This mechanism\nenables the agent to evolve beyond its static pretrained parameters, fostering\ncontinuous learning and self-evolution. We evaluate MUSE on the long-horizon\nproductivity benchmark TAC. It achieves new SOTA performance by a significant\nmargin using only a lightweight Gemini-2.5 Flash model. Sufficient Experiments\ndemonstrate that as the agent autonomously accumulates experience, it exhibits\nincreasingly superior task completion capabilities, as well as robust\ncontinuous learning and self-evolution capabilities. Moreover, the accumulated\nexperience from MUSE exhibits strong generalization properties, enabling\nzero-shot improvement on new tasks. MUSE establishes a new paradigm for AI\nagents capable of real-world productivity task automation."}
{"id": "2510.07550", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.07550", "abs": "https://arxiv.org/abs/2510.07550", "authors": ["Saman Motamed", "Minghao Chen", "Luc Van Gool", "Iro Laina"], "title": "TRAVL: A Recipe for Making Video-Language Models Better Judges of Physics Implausibility", "comment": null, "summary": "Despite impressive visual fidelity, modern video generative models frequently\nproduce sequences that violate intuitive physical laws, such as objects\nfloating, teleporting, or morphing in ways that defy causality. While humans\ncan easily detect such implausibilities, there remains no robust method for\nquantitatively assessing physical realism in video. In this work, we explore\nwhether Video-Language Models (VLMs) can be trained to serve as reliable judges\nof physical plausibility. We find that existing VLMs struggle to identify\nphysics violations, exposing fundamental limitations in their temporal and\ncausal reasoning. To address this, we introduce TRAVL, a fine-tuning recipe\nthat combines a balanced training dataset with a trajectory-aware attention\nmodule to improve motion encoding and discrimination in VLMs. To evaluate\nphysical reasoning more rigorously, we propose ImplausiBench, a benchmark of\n300 videos (150 real, 150 generated) that removes linguistic biases and\nisolates visual-temporal understanding. Performance is reported both with\ngold-standard human judgments and stricter LLM-as-judge metrics. Together,\nTRAVL and ImplausiBench offer a unified framework for probing and improving\nphysical plausibility in multimodal models, shedding light on a challenging and\nunderexplored aspect of visual-temporal understanding."}
{"id": "2510.07856", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.07856", "abs": "https://arxiv.org/abs/2510.07856", "authors": ["Haochen Yu", "Qiankun Liu", "Hongyuan Liu", "Jianfei Jiang", "Juntao Lyu", "Jiansheng Chen", "Huimin Ma"], "title": "XYZCylinder: Feedforward Reconstruction for Driving Scenes Based on A Unified Cylinder Lifting Method", "comment": "Project page: https://yuyuyu223.github.io/XYZCYlinder-projectpage/", "summary": "Recently, more attention has been paid to feedforward reconstruction\nparadigms, which mainly learn a fixed view transformation implicitly and\nreconstruct the scene with a single representation. However, their\ngeneralization capability and reconstruction accuracy are still limited while\nreconstructing driving scenes, which results from two aspects: (1) The fixed\nview transformation fails when the camera configuration changes, limiting the\ngeneralization capability across different driving scenes equipped with\ndifferent camera configurations. (2) The small overlapping regions between\nsparse views of the $360^\\circ$ panorama and the complexity of driving scenes\nincrease the learning difficulty, reducing the reconstruction accuracy. To\nhandle these difficulties, we propose \\textbf{XYZCylinder}, a feedforward model\nbased on a unified cylinder lifting method which involves camera modeling and\nfeature lifting. Specifically, to improve the generalization capability, we\ndesign a Unified Cylinder Camera Modeling (UCCM) strategy, which avoids the\nlearning of viewpoint-dependent spatial correspondence and unifies different\ncamera configurations with adjustable parameters. To improve the reconstruction\naccuracy, we propose a hybrid representation with several dedicated modules\nbased on newly designed Cylinder Plane Feature Group (CPFG) to lift 2D image\nfeatures to 3D space. Experimental results show that XYZCylinder achieves\nstate-of-the-art performance under different evaluation settings, and can be\ngeneralized to other driving scenes in a zero-shot manner. Project page:\n\\href{https://yuyuyu223.github.io/XYZCYlinder-projectpage/}{here}."}
{"id": "2510.08049", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.08049", "abs": "https://arxiv.org/abs/2510.08049", "authors": ["Congming Zheng", "Jiachen Zhu", "Zhuoying Ou", "Yuxiang Chen", "Kangning Zhang", "Rong Shan", "Zeyu Zheng", "Mengyue Yang", "Jianghao Lin", "Yong Yu", "Weinan Zhang"], "title": "A Survey of Process Reward Models: From Outcome Signals to Process Supervisions for Large Language Models", "comment": null, "summary": "Although Large Language Models (LLMs) exhibit advanced reasoning ability,\nconventional alignment remains largely dominated by outcome reward models\n(ORMs) that judge only final answers. Process Reward Models(PRMs) address this\ngap by evaluating and guiding reasoning at the step or trajectory level. This\nsurvey provides a systematic overview of PRMs through the full loop: how to\ngenerate process data, build PRMs, and use PRMs for test-time scaling and\nreinforcement learning. We summarize applications across math, code, text,\nmultimodal reasoning, robotics, and agents, and review emerging benchmarks. Our\ngoal is to clarify design spaces, reveal open challenges, and guide future\nresearch toward fine-grained, robust reasoning alignment."}
{"id": "2510.07556", "categories": ["cs.CV", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.07556", "abs": "https://arxiv.org/abs/2510.07556", "authors": ["Rafin Hassan", "Zarin Tasnim Roshni", "Rafiqul Bari", "Alimul Islam", "Nabeel Mohammed", "Moshiur Farazi", "Shafin Rahman"], "title": "Label Semantics for Robust Hyperspectral Image Classification", "comment": "This work has been accepted for publication in the proceedings of\n  IJCNN 2025", "summary": "Hyperspectral imaging (HSI) classification is a critical tool with widespread\napplications across diverse fields such as agriculture, environmental\nmonitoring, medicine, and materials science. Due to the limited availability of\nhigh-quality training samples and the high dimensionality of spectral data, HSI\nclassification models are prone to overfitting and often face challenges in\nbalancing accuracy and computational complexity. Furthermore, most of HSI\nclassification models are monomodal, where it solely relies on spectral-spatial\ndata to learn decision boundaries in the high dimensional embedding space. To\naddress this, we propose a general-purpose Semantic Spectral-Spatial Fusion\nNetwork (S3FN) that uses contextual, class specific textual descriptions to\ncomplement the training of an HSI classification model. Specifically, S3FN\nleverages LLMs to generate comprehensive textual descriptions for each class\nlabel that captures their unique characteristics and spectral behaviors. These\ndescriptions are then embedded into a vector space using a pre-trained text\nencoder such as BERT or RoBERTa to extract meaningful label semantics which in\nturn leads to a better feature-label alignment for improved classification\nperformance. To demonstrate the effectiveness of our approach, we evaluate our\nmodel on three diverse HSI benchmark datasets - Hyperspectral Wood,\nHyperspectralBlueberries, and DeepHS-Fruit and report significant performance\nboost. Our results highlight the synergy between textual semantics and\nspectral-spatial data, paving the way for further advancements in semantically\naugmented HSI classification models. Codes are be available in:\nhttps://github.com/milab-nsu/S3FN"}
{"id": "2510.07915", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.07915", "abs": "https://arxiv.org/abs/2510.07915", "authors": ["Peiran Wu", "Zhuorui Yu", "Yunze Liu", "Chi-Hao Wu", "Enmin Zhou", "Junxiao Shen"], "title": "MARC: Memory-Augmented RL Token Compression for Efficient Video Understanding", "comment": null, "summary": "The rapid progress of large language models (LLMs) has laid the foundation\nfor multimodal models. However, visual language models (VLMs) still face heavy\ncomputational costs when extended from images to videos due to high frame rates\nand long durations. Token compression is a promising solution, yet most\nexisting training-free methods cause information loss and performance\ndegradation. To overcome this, we propose \\textbf{Memory-Augmented\nReinforcement Learning-based Token Compression (MARC)}, which integrates\nstructured retrieval and RL-based distillation. MARC adopts a\n\\textit{retrieve-then-compress} strategy using a \\textbf{Visual Memory\nRetriever (VMR)} to select key clips and a \\textbf{Compression Group Relative\nPolicy Optimization (C-GRPO)} framework to distil reasoning ability from a\nteacher to a student model. Experiments on six video benchmarks show that MARC\nachieves near-baseline accuracy using only one frame's tokens -- reducing\nvisual tokens by \\textbf{95\\%}, GPU memory by \\textbf{72\\%}, and latency by\n\\textbf{23.9\\%}. This demonstrates its potential for efficient, real-time video\nunderstanding in resource-constrained settings such as video QA, surveillance,\nand autonomous driving."}
{"id": "2510.08152", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.08152", "abs": "https://arxiv.org/abs/2510.08152", "authors": ["Elena Khasanova", "Harsh Saini", "Md Tahmid Rahman Laskar", "Xue-Yong Fu", "Cheng Chen", "Shashi Bhushan TN"], "title": "DACIP-RC: Domain Adaptive Continual Instruction Pre-Training via Reading Comprehension on Business Conversations", "comment": "Accepted to the EMNLP 2025 Industry Track. Equal contribution from\n  the first four authors", "summary": "The rapid advancements in Large Language Models (LLMs) have enabled their\nadoption in real-world industrial scenarios for various natural language\nprocessing tasks. However, the high inference cost of large-scale LLMs makes\ntheir deployment impractical, necessitating the use of smaller models. Despite\ntheir efficiency, smaller LLMs lack robust zero-shot instruction-following\ncapabilities across diverse domains, limiting their adaptability to dynamic\nuser requirements. Traditional fine-tuning approaches exacerbate this issue by\ninducing catastrophic forgetting, reducing the model's generalization ability\nfor unseen tasks. In this paper, we propose Domain Adaptive Continual\nInstruction Pre-Training via Reading Comprehension (DACIP-RC), a continual\npre-training technique that enhances smaller LLMs' domain adaptability for\nbusiness conversational tasks. Unlike conventional pre-training approaches that\nrely on next-token prediction, DACIP-RC generates diverse task instructions and\nresponses via reading comprehension on conversation transcripts, enabling\nbetter instruction generalization. Our empirical evaluations demonstrate that\nDACIP-RC significantly improves zero-shot generalization across a wide range of\nbusiness conversational tasks, including meeting summarization, action item\ngeneration, and call purpose identification. To the best of our knowledge, this\nis the first work to apply instruction pre-training on business conversational\ndata, providing insights into how industries can leverage proprietary datasets\nfor domain adaptation."}
{"id": "2510.07793", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.07793", "abs": "https://arxiv.org/abs/2510.07793", "authors": ["Sajib Acharjee Dip", "Adrika Zafor", "Bikash Kumar Paul", "Uddip Acharjee Shuvo", "Muhit Islam Emon", "Xuan Wang", "Liqing Zhang"], "title": "LLM4Cell: A Survey of Large Language and Agentic Models for Single-Cell Biology", "comment": "34 pages, 5 figures, 7 tables", "summary": "Large language models (LLMs) and emerging agentic frameworks are beginning to\ntransform single-cell biology by enabling natural-language reasoning,\ngenerative annotation, and multimodal data integration. However, progress\nremains fragmented across data modalities, architectures, and evaluation\nstandards. LLM4Cell presents the first unified survey of 58 foundation and\nagentic models developed for single-cell research, spanning RNA, ATAC,\nmulti-omic, and spatial modalities. We categorize these methods into five\nfamilies-foundation, text-bridge, spatial, multimodal, epigenomic, and\nagentic-and map them to eight key analytical tasks including annotation,\ntrajectory and perturbation modeling, and drug-response prediction. Drawing on\nover 40 public datasets, we analyze benchmark suitability, data diversity, and\nethical or scalability constraints, and evaluate models across 10 domain\ndimensions covering biological grounding, multi-omics alignment, fairness,\nprivacy, and explainability. By linking datasets, models, and evaluation\ndomains, LLM4Cell provides the first integrated view of language-driven\nsingle-cell intelligence and outlines open challenges in interpretability,\nstandardization, and trustworthy model development."}
{"id": "2510.07940", "categories": ["cs.CV", "cs.AI", "cs.CL", "cs.LG", "cs.MM"], "pdf": "https://arxiv.org/pdf/2510.07940", "abs": "https://arxiv.org/abs/2510.07940", "authors": ["Leigang Qu", "Ziyang Wang", "Na Zheng", "Wenjie Wang", "Liqiang Nie", "Tat-Seng Chua"], "title": "TTOM: Test-Time Optimization and Memorization for Compositional Video Generation", "comment": "Project page: https://ttom-t2v.github.io/", "summary": "Video Foundation Models (VFMs) exhibit remarkable visual generation\nperformance, but struggle in compositional scenarios (e.g., motion, numeracy,\nand spatial relation). In this work, we introduce Test-Time Optimization and\nMemorization (TTOM), a training-free framework that aligns VFM outputs with\nspatiotemporal layouts during inference for better text-image alignment. Rather\nthan direct intervention to latents or attention per-sample in existing work,\nwe integrate and optimize new parameters guided by a general layout-attention\nobjective. Furthermore, we formulate video generation within a streaming\nsetting, and maintain historical optimization contexts with a parametric memory\nmechanism that supports flexible operations, such as insert, read, update, and\ndelete. Notably, we found that TTOM disentangles compositional world knowledge,\nshowing powerful transferability and generalization. Experimental results on\nthe T2V-CompBench and Vbench benchmarks establish TTOM as an effective,\npractical, scalable, and efficient framework to achieve cross-modal alignment\nfor compositional video generation on the fly."}
{"id": "2510.08163", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2510.08163", "abs": "https://arxiv.org/abs/2510.08163", "authors": ["Jian Xie", "Zhendong Chu", "Aoxiao Zhong", "Kai Zhang", "Mingzhe Han", "Xin Fang", "Jialie Shen", "Qingsong Wen"], "title": "ARM2: Adaptive Reasoning Model with Vision Understanding and Executable Code", "comment": "Work in Progress", "summary": "Large Reasoning Models (LRMs) often suffer from the ``over-thinking''\nproblem, generating unnecessarily long reasoning on simple tasks. Some\nstrategies have been proposed to mitigate this issue, such as length penalties\nor routing mechanisms, but they are typically heuristic and task-specific,\nlacking a general framework for adaptive reasoning. In this paper, we present\nARM2, a unified model that adaptively balances reasoning performance and\nefficiency across multiple formats through a reinforcement learning framework\naugmented with length-aware optimization. Beyond conventional natural language\ninference, ARM2 integrates vision understanding, extending its applicability to\nmultimodal. Moreover, ARM2 integrates executable code into reasoning, enabling\nsubstantial reductions in token cost while preserving task performance compared\nto long CoT. Experiments demonstrate that ARM2 achieves performance on par with\ntraditional reasoning models trained with GRPO, while reducing token usage by\nover 70% on average. We further conduct extensive analyses to validate the\neffectiveness of ARM2 and the soundness of its design."}
{"id": "2510.07940", "categories": ["cs.CV", "cs.AI", "cs.CL", "cs.LG", "cs.MM"], "pdf": "https://arxiv.org/pdf/2510.07940", "abs": "https://arxiv.org/abs/2510.07940", "authors": ["Leigang Qu", "Ziyang Wang", "Na Zheng", "Wenjie Wang", "Liqiang Nie", "Tat-Seng Chua"], "title": "TTOM: Test-Time Optimization and Memorization for Compositional Video Generation", "comment": "Project page: https://ttom-t2v.github.io/", "summary": "Video Foundation Models (VFMs) exhibit remarkable visual generation\nperformance, but struggle in compositional scenarios (e.g., motion, numeracy,\nand spatial relation). In this work, we introduce Test-Time Optimization and\nMemorization (TTOM), a training-free framework that aligns VFM outputs with\nspatiotemporal layouts during inference for better text-image alignment. Rather\nthan direct intervention to latents or attention per-sample in existing work,\nwe integrate and optimize new parameters guided by a general layout-attention\nobjective. Furthermore, we formulate video generation within a streaming\nsetting, and maintain historical optimization contexts with a parametric memory\nmechanism that supports flexible operations, such as insert, read, update, and\ndelete. Notably, we found that TTOM disentangles compositional world knowledge,\nshowing powerful transferability and generalization. Experimental results on\nthe T2V-CompBench and Vbench benchmarks establish TTOM as an effective,\npractical, scalable, and efficient framework to achieve cross-modal alignment\nfor compositional video generation on the fly."}
{"id": "2510.08003", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.08003", "abs": "https://arxiv.org/abs/2510.08003", "authors": ["Weihuang Lin", "Yiwei Ma", "Jiayi Ji", "Xiaoshuai Sun", "Rongrong Ji"], "title": "CIR-CoT: Towards Interpretable Composed Image Retrieval via End-to-End Chain-of-Thought Reasoning", "comment": null, "summary": "Composed Image Retrieval (CIR), which aims to find a target image from a\nreference image and a modification text, presents the core challenge of\nperforming unified reasoning across visual and semantic modalities. While\ncurrent approaches based on Vision-Language Models (VLMs, e.g., CLIP) and more\nrecent Multimodal Large Language Models (MLLMs, e.g., Qwen-VL) have shown\nprogress, they predominantly function as ``black boxes.\" This inherent opacity\nnot only prevents users from understanding the retrieval rationale but also\nrestricts the models' ability to follow complex, fine-grained instructions. To\novercome these limitations, we introduce CIR-CoT, the first end-to-end\nretrieval-oriented MLLM designed to integrate explicit Chain-of-Thought (CoT)\nreasoning. By compelling the model to first generate an interpretable reasoning\nchain, CIR-CoT enhances its ability to capture crucial cross-modal\ninteractions, leading to more accurate retrieval while making its decision\nprocess transparent. Since existing datasets like FashionIQ and CIRR lack the\nnecessary reasoning data, a key contribution of our work is the creation of\nstructured CoT annotations using a three-stage process involving a caption,\nreasoning, and conclusion. Our model is then fine-tuned to produce this\nstructured output before encoding its final retrieval intent into a dedicated\nembedding. Comprehensive experiments show that CIR-CoT achieves highly\ncompetitive performance on in-domain datasets (FashionIQ, CIRR) and\ndemonstrates remarkable generalization on the out-of-domain CIRCO dataset,\nestablishing a new path toward more effective and trustworthy retrieval\nsystems."}
{"id": "2510.08404", "categories": ["cs.CL", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.08404", "abs": "https://arxiv.org/abs/2510.08404", "authors": ["Noor Ul Zain", "Mohsin Raza", "Ahsan Adeel"], "title": "Single layer tiny Co$^4$ outpaces GPT-2 and GPT-BERT", "comment": null, "summary": "We show that a tiny Co$^4$ machine(Adeel,2025) with a single layer, two\nheads, and 8M parameters, operating at an approximate cost of $O(N)$ (where $N$\nis the number of input tokens), outpaces the BabyLM Challenge baselines GPT-2\n(124M, 12 layers, $O(N^2))$ and GPT-BERT (30M, 12 layers, $O(N^2))$ in just two\nepochs, while both are trained for ten. Co$^4$ achieves orders-of-magnitude\ngreater training efficiency on 10M tokens, demonstrating highly sample\nefficient pretraining. Using the BabyLM challenge evaluation pipeline across\ncomplex benchmarks, Co$^4$ exhibits strong zero-shot and fine-tuning\nperformance on SuperGLUE tasks. Specifically, Co$^4$ outperforms GPT-2 on 5 out\nof 7 zero-shot metrics and 6 out of 7 fine-tuning tasks, and GPT-BERT on 4 out\nof 7 metrics in both cases. These results suggest the need to rethink\nprevailing deep learning paradigms and associated scaling laws."}
{"id": "2510.07993", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.07993", "abs": "https://arxiv.org/abs/2510.07993", "authors": ["Watcharapong Timklaypachara", "Monrada Chiewhawan", "Nopporn Lekuthai", "Titipat Achakulvisut"], "title": "Leveraging Author-Specific Context for Scientific Figure Caption Generation: 3rd SciCap Challenge", "comment": null, "summary": "Scientific figure captions require both accuracy and stylistic consistency to\nconvey visual information. Here, we present a domain-specific caption\ngeneration system for the 3rd SciCap Challenge that integrates figure-related\ntextual context with author-specific writing styles using the LaMP-Cap dataset.\nOur approach uses a two-stage pipeline: Stage 1 combines context filtering,\ncategory-specific prompt optimization via DSPy's MIPROv2 and SIMBA, and caption\ncandidate selection; Stage 2 applies few-shot prompting with profile figures\nfor stylistic refinement. Our experiments demonstrate that category-specific\nprompts outperform both zero-shot and general optimized approaches, improving\nROUGE-1 recall by +8.3\\% while limiting precision loss to -2.8\\% and BLEU-4\nreduction to -10.9\\%. Profile-informed stylistic refinement yields 40--48\\%\ngains in BLEU scores and 25--27\\% in ROUGE. Overall, our system demonstrates\nthat combining contextual understanding with author-specific stylistic\nadaptation can generate captions that are both scientifically accurate and\nstylistically faithful to the source paper."}
{"id": "2510.08094", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.08094", "abs": "https://arxiv.org/abs/2510.08094", "authors": ["Ziqi Zhou", "Menghao Deng", "Yufei Song", "Hangtao Zhang", "Wei Wan", "Shengshan Hu", "Minghui Li", "Leo Yu Zhang", "Dezhong Yao"], "title": "DarkHash: A Data-Free Backdoor Attack Against Deep Hashing", "comment": "Accepted by TIFS 2025", "summary": "Benefiting from its superior feature learning capabilities and efficiency,\ndeep hashing has achieved remarkable success in large-scale image retrieval.\nRecent studies have demonstrated the vulnerability of deep hashing models to\nbackdoor attacks. Although these studies have shown promising attack results,\nthey rely on access to the training dataset to implant the backdoor. In the\nreal world, obtaining such data (e.g., identity information) is often\nprohibited due to privacy protection and intellectual property concerns.\nEmbedding backdoors into deep hashing models without access to the training\ndata, while maintaining retrieval accuracy for the original task, presents a\nnovel and challenging problem. In this paper, we propose DarkHash, the first\ndata-free backdoor attack against deep hashing. Specifically, we design a novel\nshadow backdoor attack framework with dual-semantic guidance. It embeds\nbackdoor functionality and maintains original retrieval accuracy by fine-tuning\nonly specific layers of the victim model using a surrogate dataset. We consider\nleveraging the relationship between individual samples and their neighbors to\nenhance backdoor attacks during training. By designing a topological alignment\nloss, we optimize both individual and neighboring poisoned samples toward the\ntarget sample, further enhancing the attack capability. Experimental results on\nfour image datasets, five model architectures, and two hashing methods\ndemonstrate the high effectiveness of DarkHash, outperforming existing\nstate-of-the-art backdoor attack methods. Defense experiments show that\nDarkHash can withstand existing mainstream backdoor defense methods."}
{"id": "2510.08457", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2510.08457", "abs": "https://arxiv.org/abs/2510.08457", "authors": ["Shuang Chen", "Yue Guo", "Yimeng Ye", "Shijue Huang", "Wenbo Hu", "Haoxi Li", "Manyuan Zhang", "Jiayu Chen", "Song Guo", "Nanyun Peng"], "title": "ARES: Multimodal Adaptive Reasoning via Difficulty-Aware Token-Level Entropy Shaping", "comment": null, "summary": "Recent advances in multimodal large reasoning models (MLRMs) have\nsubstantially improved their ability to solve complex textual and visual tasks.\nHowever, these models tend to overthink on simple problems, producing\nunnecessarily lengthy reasoning traces, while under-exploring on challenging\nones, leading to missed solutions. To address this imbalance, we propose ARES,\na unified open-source framework for adaptive reasoning that dynamically\nallocates exploration effort based on task difficulty. Our approach is\nmotivated by two key empirical findings: (i) while single-token entropy is\nnoisy, high window-entropy (HWE) tokens (token-level entropies averaged under a\nsliding window) can reliably capture reasoning-critical moments; and (ii)\nreducing HWE usage benefits easy problems, while increasing it is essential for\nsolving hard ones. Building on these insights, ARES introduces a two-stage\ntraining pipeline. In the Adaptive Cold-Start stage, we curate multimodal and\ntextual data paired with reasoning traces of length proportional to problem\ndifficulty, equipping the model with initial difficulty awareness. In the\nsecond stage, we develop Adaptive Entropy Policy Optimization (AEPO), which\nuses HWE tokens as exploration triggers to decide when to explore, and a\nhierarchical entropy reward with dynamic KL control to decide how much to\nexplore. Extensive experiments demonstrate that ARES achieves superior\nperformance and reasoning efficiency across diverse mathematical, logical, and\nmultimodal benchmarks, while closing the gap to leading commercial systems\nunder significantly lower inference costs."}
{"id": "2510.08002", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.08002", "abs": "https://arxiv.org/abs/2510.08002", "authors": ["Cheng Yang", "Xuemeng Yang", "Licheng Wen", "Daocheng Fu", "Jianbiao Mei", "Rong Wu", "Pinlong Cai", "Yufan Shen", "Nianchen Deng", "Botian Shi", "Yu Qiao", "Haifeng Li"], "title": "Learning on the Job: An Experience-Driven Self-Evolving Agent for Long-Horizon Tasks", "comment": null, "summary": "Large Language Models have demonstrated remarkable capabilities across\ndiverse domains, yet significant challenges persist when deploying them as AI\nagents for real-world long-horizon tasks. Existing LLM agents suffer from a\ncritical limitation: they are test-time static and cannot learn from\nexperience, lacking the ability to accumulate knowledge and continuously\nimprove on the job. To address this challenge, we propose MUSE, a novel agent\nframework that introduces an experience-driven, self-evolving system centered\naround a hierarchical Memory Module. MUSE organizes diverse levels of\nexperience and leverages them to plan and execute long-horizon tasks across\nmultiple applications. After each sub-task execution, the agent autonomously\nreflects on its trajectory, converting the raw trajectory into structured\nexperience and integrating it back into the Memory Module. This mechanism\nenables the agent to evolve beyond its static pretrained parameters, fostering\ncontinuous learning and self-evolution. We evaluate MUSE on the long-horizon\nproductivity benchmark TAC. It achieves new SOTA performance by a significant\nmargin using only a lightweight Gemini-2.5 Flash model. Sufficient Experiments\ndemonstrate that as the agent autonomously accumulates experience, it exhibits\nincreasingly superior task completion capabilities, as well as robust\ncontinuous learning and self-evolution capabilities. Moreover, the accumulated\nexperience from MUSE exhibits strong generalization properties, enabling\nzero-shot improvement on new tasks. MUSE establishes a new paradigm for AI\nagents capable of real-world productivity task automation."}
{"id": "2510.08138", "categories": ["cs.CV", "cs.AI", "cs.MM"], "pdf": "https://arxiv.org/pdf/2510.08138", "abs": "https://arxiv.org/abs/2510.08138", "authors": ["Chengzhi Li", "Heyan Huang", "Ping Jian", "Zhen Yang", "Yaning Tian"], "title": "Improving Temporal Understanding Logic Consistency in Video-Language Models via Attention Enhancement", "comment": null, "summary": "Large language models (LLMs) often generate self-contradictory outputs, which\nseverely impacts their reliability and hinders their adoption in practical\napplications. In video-language models (Video-LLMs), this phenomenon recently\ndraws the attention of researchers. Specifically, these models fail to provide\nlogically consistent responses to rephrased questions based on their grounding\noutputs. However, the underlying causes of this phenomenon remain\nunderexplored. In this work, we adopt an interpretability-driven approach to\nanalyze, statistically summarize, and intervention the potential factors of the\nphenomenon. We find that one of the primary reasons for the inconsistency in\nresponses lies in the inability of cross-modal attention heads to effectively\ndistinguish video tokens across different timestamps. To address this, we\npropose an attention enhancement method called Temporally Conditioned Attention\nSharpening (TCAS), which constructs an enhancement objective based on attention\ndistinctions to enhance the model's temporal resolution capability, thereby\nimproving its temporal understanding logic consistency. Experimental results\ndemonstrate that our method significantly enhances the temporal logic\nconsistency of Video-LLMs. Further interpretability analyses reveal that our\nmethod indeed improves the temporal discriminability of attention heads,\nvalidating our conclusions. Additionally, our method achieves performance\nimprovements in general video temporal grounding tasks, highlighting that\ntemporal logic consistency is a bottleneck in temporal understanding. By\nenhancing consistency, our method drives significant progress in video temporal\nunderstanding."}
{"id": "2510.07489", "categories": ["cs.AI", "cs.CL", "cs.CY", "cs.IR", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.07489", "abs": "https://arxiv.org/abs/2510.07489", "authors": ["Akhil Kumar", "Jianliang Leon Zhao", "Om Dobariya"], "title": "Evaluation of LLMs for Process Model Analysis and Optimization", "comment": "15 pages, 5 tables, 4 figures; full research paper currently under\n  review for the Workshop on Information Technologies and Systems (WITS) 2025.\n  The paper presents a comprehensive evaluation of large language models (LLMs)\n  for business process model analysis and optimization, including error\n  detection, reasoning, and scenario-based redesign", "summary": "In this paper, we report our experience with several LLMs for their ability\nto understand a process model in an interactive, conversational style, find\nsyntactical and logical errors in it, and reason with it in depth through a\nnatural language (NL) interface. Our findings show that a vanilla, untrained\nLLM like ChatGPT (model o3) in a zero-shot setting is effective in\nunderstanding BPMN process models from images and answering queries about them\nintelligently at syntactic, logic, and semantic levels of depth. Further,\ndifferent LLMs vary in performance in terms of their accuracy and\neffectiveness. Nevertheless, our empirical analysis shows that LLMs can play a\nvaluable role as assistants for business process designers and users. We also\nstudy the LLM's \"thought process\" and ability to perform deeper reasoning in\nthe context of process analysis and optimization. We find that the LLMs seem to\nexhibit anthropomorphic properties."}
{"id": "2510.08049", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.08049", "abs": "https://arxiv.org/abs/2510.08049", "authors": ["Congming Zheng", "Jiachen Zhu", "Zhuoying Ou", "Yuxiang Chen", "Kangning Zhang", "Rong Shan", "Zeyu Zheng", "Mengyue Yang", "Jianghao Lin", "Yong Yu", "Weinan Zhang"], "title": "A Survey of Process Reward Models: From Outcome Signals to Process Supervisions for Large Language Models", "comment": null, "summary": "Although Large Language Models (LLMs) exhibit advanced reasoning ability,\nconventional alignment remains largely dominated by outcome reward models\n(ORMs) that judge only final answers. Process Reward Models(PRMs) address this\ngap by evaluating and guiding reasoning at the step or trajectory level. This\nsurvey provides a systematic overview of PRMs through the full loop: how to\ngenerate process data, build PRMs, and use PRMs for test-time scaling and\nreinforcement learning. We summarize applications across math, code, text,\nmultimodal reasoning, robotics, and agents, and review emerging benchmarks. Our\ngoal is to clarify design spaces, reveal open challenges, and guide future\nresearch toward fine-grained, robust reasoning alignment."}
{"id": "2510.08143", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.08143", "abs": "https://arxiv.org/abs/2510.08143", "authors": ["Shian Du", "Menghan Xia", "Chang Liu", "Quande Liu", "Xintao Wang", "Pengfei Wan", "Xiangyang Ji"], "title": "UniMMVSR: A Unified Multi-Modal Framework for Cascaded Video Super-Resolution", "comment": null, "summary": "Cascaded video super-resolution has emerged as a promising technique for\ndecoupling the computational burden associated with generating high-resolution\nvideos using large foundation models. Existing studies, however, are largely\nconfined to text-to-video tasks and fail to leverage additional generative\nconditions beyond text, which are crucial for ensuring fidelity in multi-modal\nvideo generation. We address this limitation by presenting UniMMVSR, the first\nunified generative video super-resolution framework to incorporate hybrid-modal\nconditions, including text, images, and videos. We conduct a comprehensive\nexploration of condition injection strategies, training schemes, and data\nmixture techniques within a latent video diffusion model. A key challenge was\ndesigning distinct data construction and condition utilization methods to\nenable the model to precisely utilize all condition types, given their varied\ncorrelations with the target video. Our experiments demonstrate that UniMMVSR\nsignificantly outperforms existing methods, producing videos with superior\ndetail and a higher degree of conformity to multi-modal conditions. We also\nvalidate the feasibility of combining UniMMVSR with a base model to achieve\nmulti-modal guided generation of 4K video, a feat previously unattainable with\nexisting techniques."}
{"id": "2510.07632", "categories": ["cs.AI", "cs.CL", "cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.07632", "abs": "https://arxiv.org/abs/2510.07632", "authors": ["Yinglun Zhu", "Jiancheng Zhang", "Fuzhi Tang"], "title": "Test-Time Matching: Unlocking Compositional Reasoning in Multimodal Models", "comment": null, "summary": "Frontier AI models have achieved remarkable progress, yet recent studies\nsuggest they struggle with compositional reasoning, often performing at or\nbelow random chance on established benchmarks. We revisit this problem and show\nthat widely used evaluation metrics systematically underestimate model\ncapability. To address this, we introduce a group matching score that better\nexploits group structure and reveals substantial hidden capability in both\ncontrastive vision-language models (VLMs) and multimodal large language models\n(MLLMs). Moreover, simply overfitting to the induced group matchings at test\ntime transfers this hidden capability into higher scores under standard\nevaluation metrics, closing much of the reported gap. This adjustment enables\nSigLIP-B16 to surpass all previous results and GPT-4.1 to yield the first\nresult surpassing estimated human performance on Winoground.\n  Building on this insight, we propose Test-Time Matching (TTM), an iterative,\nself-improving algorithm that further bootstraps model performance without any\nexternal supervision. TTM delivers additional, non-trivial improvements: for\nexample, TTM enables SigLIP-B16 to surpass GPT-4.1 on MMVP-VLM, establishing a\nnew state of the art. Importantly, TTM remains broadly effective even on\nbenchmarks without metric-induced effects or group structures, achieving\nrelative gains up to 85.7% on challenging datasets such as WhatsUp. Across 16\ndataset variants spanning diverse setups, our experiments demonstrate that TTM\nconsistently improves model performance and advances the frontier of\ncompositional reasoning."}
{"id": "2510.08138", "categories": ["cs.CV", "cs.AI", "cs.MM"], "pdf": "https://arxiv.org/pdf/2510.08138", "abs": "https://arxiv.org/abs/2510.08138", "authors": ["Chengzhi Li", "Heyan Huang", "Ping Jian", "Zhen Yang", "Yaning Tian"], "title": "Improving Temporal Understanding Logic Consistency in Video-Language Models via Attention Enhancement", "comment": null, "summary": "Large language models (LLMs) often generate self-contradictory outputs, which\nseverely impacts their reliability and hinders their adoption in practical\napplications. In video-language models (Video-LLMs), this phenomenon recently\ndraws the attention of researchers. Specifically, these models fail to provide\nlogically consistent responses to rephrased questions based on their grounding\noutputs. However, the underlying causes of this phenomenon remain\nunderexplored. In this work, we adopt an interpretability-driven approach to\nanalyze, statistically summarize, and intervention the potential factors of the\nphenomenon. We find that one of the primary reasons for the inconsistency in\nresponses lies in the inability of cross-modal attention heads to effectively\ndistinguish video tokens across different timestamps. To address this, we\npropose an attention enhancement method called Temporally Conditioned Attention\nSharpening (TCAS), which constructs an enhancement objective based on attention\ndistinctions to enhance the model's temporal resolution capability, thereby\nimproving its temporal understanding logic consistency. Experimental results\ndemonstrate that our method significantly enhances the temporal logic\nconsistency of Video-LLMs. Further interpretability analyses reveal that our\nmethod indeed improves the temporal discriminability of attention heads,\nvalidating our conclusions. Additionally, our method achieves performance\nimprovements in general video temporal grounding tasks, highlighting that\ntemporal logic consistency is a bottleneck in temporal understanding. By\nenhancing consistency, our method drives significant progress in video temporal\nunderstanding."}
{"id": "2510.08157", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.08157", "abs": "https://arxiv.org/abs/2510.08157", "authors": ["Zhentao Zou", "Zhengrong Yue", "Kunpeng Du", "Binlei Bao", "Hanting Li", "Haizhen Xie", "Guozheng Xu", "Yue Zhou", "Yali Wang", "Jie Hu", "Xue Jiang", "Xinghao Chen"], "title": "Beyond Textual CoT: Interleaved Text-Image Chains with Deep Confidence Reasoning for Image Editing", "comment": "25pages,20figures", "summary": "Image editing with natural language has gained significant popularity, yet\nexisting methods struggle with intricate object intersections and fine-grained\nspatial relationships due to the lack of an explicit reasoning process. While\nChain-of-Thought (CoT) has been explored to enhance reasoning, purely textual\nCoT or CoT augmented with coordinate information is fundamentally limited in\nits ability to represent intricate visual layouts and lacks the necessary\nvisual cues to guide the generation of fine-grained, pixel-level details. To\naddress these challenges, we propose Multimodal Reasoning Edit (MURE), a novel\nframework that shifts the visual editing process from purely text-based\nreasoning to a series of interleaved textual and visual rationales. Our\nframework performs image editing using a natively multimodal, interleaved\ntext-image CoT. This approach generates a step-by-step chain of reasoning where\na textual description is followed by a corresponding visual cue, such as a\npositional mask that defined intended edited regions or a representation of new\ncontent. Furthermore, to mitigate the hallucination phenomenon of large\nlanguage models, we introduce Multimodal Deep Confidence (MMDC) reasoning\nparadigm. This paradigm explores a tree of visual reasoning paths at each step.\nBy pruning low-quality branches using a deep confidence score from a reward\nmodel, it ensures the model consistently follows a high-quality trajectory\ntowards the final edited result. The proposed method decomposes complex editing\ntasks into interdependent sub-tasks, achieving greater precision at each stage\nand yielding high-fidelity edited results. We define the formulation for\ninterleaved text-image chains and release the first CoT-Edit-14K dataset,\ncomprising 14K high-quality editing examples. Extensive experiments show that\nour method yields significant improvements across three image editing\nbenchmarks."}
{"id": "2510.07709", "categories": ["cs.AI", "cs.CL", "cs.CY", "cs.MA"], "pdf": "https://arxiv.org/pdf/2510.07709", "abs": "https://arxiv.org/abs/2510.07709", "authors": ["Alhim Vera", "Karen Sanchez", "Carlos Hinojosa", "Haidar Bin Hamid", "Donghoon Kim", "Bernard Ghanem"], "title": "Multimodal Safety Evaluation in Generative Agent Social Simulations", "comment": null, "summary": "Can generative agents be trusted in multimodal environments? Despite advances\nin large language and vision-language models that enable agents to act\nautonomously and pursue goals in rich settings, their ability to reason about\nsafety, coherence, and trust across modalities remains limited. We introduce a\nreproducible simulation framework for evaluating agents along three dimensions:\n(1) safety improvement over time, including iterative plan revisions in\ntext-visual scenarios; (2) detection of unsafe activities across multiple\ncategories of social situations; and (3) social dynamics, measured as\ninteraction counts and acceptance ratios of social exchanges. Agents are\nequipped with layered memory, dynamic planning, multimodal perception, and are\ninstrumented with SocialMetrics, a suite of behavioral and structural metrics\nthat quantifies plan revisions, unsafe-to-safe conversions, and information\ndiffusion across networks. Experiments show that while agents can detect direct\nmultimodal contradictions, they often fail to align local revisions with global\nsafety, reaching only a 55 percent success rate in correcting unsafe plans.\nAcross eight simulation runs with three models - Claude, GPT-4o mini, and\nQwen-VL - five agents achieved average unsafe-to-safe conversion rates of 75,\n55, and 58 percent, respectively. Overall performance ranged from 20 percent in\nmulti-risk scenarios with GPT-4o mini to 98 percent in localized contexts such\nas fire/heat with Claude. Notably, 45 percent of unsafe actions were accepted\nwhen paired with misleading visuals, showing a strong tendency to overtrust\nimages. These findings expose critical limitations in current architectures and\nprovide a reproducible platform for studying multimodal safety, coherence, and\nsocial dynamics."}
{"id": "2510.08152", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.08152", "abs": "https://arxiv.org/abs/2510.08152", "authors": ["Elena Khasanova", "Harsh Saini", "Md Tahmid Rahman Laskar", "Xue-Yong Fu", "Cheng Chen", "Shashi Bhushan TN"], "title": "DACIP-RC: Domain Adaptive Continual Instruction Pre-Training via Reading Comprehension on Business Conversations", "comment": "Accepted to the EMNLP 2025 Industry Track. Equal contribution from\n  the first four authors", "summary": "The rapid advancements in Large Language Models (LLMs) have enabled their\nadoption in real-world industrial scenarios for various natural language\nprocessing tasks. However, the high inference cost of large-scale LLMs makes\ntheir deployment impractical, necessitating the use of smaller models. Despite\ntheir efficiency, smaller LLMs lack robust zero-shot instruction-following\ncapabilities across diverse domains, limiting their adaptability to dynamic\nuser requirements. Traditional fine-tuning approaches exacerbate this issue by\ninducing catastrophic forgetting, reducing the model's generalization ability\nfor unseen tasks. In this paper, we propose Domain Adaptive Continual\nInstruction Pre-Training via Reading Comprehension (DACIP-RC), a continual\npre-training technique that enhances smaller LLMs' domain adaptability for\nbusiness conversational tasks. Unlike conventional pre-training approaches that\nrely on next-token prediction, DACIP-RC generates diverse task instructions and\nresponses via reading comprehension on conversation transcripts, enabling\nbetter instruction generalization. Our empirical evaluations demonstrate that\nDACIP-RC significantly improves zero-shot generalization across a wide range of\nbusiness conversational tasks, including meeting summarization, action item\ngeneration, and call purpose identification. To the best of our knowledge, this\nis the first work to apply instruction pre-training on business conversational\ndata, providing insights into how industries can leverage proprietary datasets\nfor domain adaptation."}
{"id": "2510.08181", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.08181", "abs": "https://arxiv.org/abs/2510.08181", "authors": ["Haoran Yu", "Yi Shi"], "title": "InstructUDrag: Joint Text Instructions and Object Dragging for Interactive Image Editing", "comment": null, "summary": "Text-to-image diffusion models have shown great potential for image editing,\nwith techniques such as text-based and object-dragging methods emerging as key\napproaches. However, each of these methods has inherent limitations: text-based\nmethods struggle with precise object positioning, while object dragging methods\nare confined to static relocation. To address these issues, we propose\nInstructUDrag, a diffusion-based framework that combines text instructions with\nobject dragging, enabling simultaneous object dragging and text-based image\nediting. Our framework treats object dragging as an image reconstruction\nprocess, divided into two synergistic branches. The moving-reconstruction\nbranch utilizes energy-based gradient guidance to move objects accurately,\nrefining cross-attention maps to enhance relocation precision. The text-driven\nediting branch shares gradient signals with the reconstruction branch, ensuring\nconsistent transformations and allowing fine-grained control over object\nattributes. We also employ DDPM inversion and inject prior information into\nnoise maps to preserve the structure of moved objects. Extensive experiments\ndemonstrate that InstructUDrag facilitates flexible, high-fidelity image\nediting, offering both precision in object relocation and semantic control over\nimage content."}
{"id": "2510.07940", "categories": ["cs.CV", "cs.AI", "cs.CL", "cs.LG", "cs.MM"], "pdf": "https://arxiv.org/pdf/2510.07940", "abs": "https://arxiv.org/abs/2510.07940", "authors": ["Leigang Qu", "Ziyang Wang", "Na Zheng", "Wenjie Wang", "Liqiang Nie", "Tat-Seng Chua"], "title": "TTOM: Test-Time Optimization and Memorization for Compositional Video Generation", "comment": "Project page: https://ttom-t2v.github.io/", "summary": "Video Foundation Models (VFMs) exhibit remarkable visual generation\nperformance, but struggle in compositional scenarios (e.g., motion, numeracy,\nand spatial relation). In this work, we introduce Test-Time Optimization and\nMemorization (TTOM), a training-free framework that aligns VFM outputs with\nspatiotemporal layouts during inference for better text-image alignment. Rather\nthan direct intervention to latents or attention per-sample in existing work,\nwe integrate and optimize new parameters guided by a general layout-attention\nobjective. Furthermore, we formulate video generation within a streaming\nsetting, and maintain historical optimization contexts with a parametric memory\nmechanism that supports flexible operations, such as insert, read, update, and\ndelete. Notably, we found that TTOM disentangles compositional world knowledge,\nshowing powerful transferability and generalization. Experimental results on\nthe T2V-CompBench and Vbench benchmarks establish TTOM as an effective,\npractical, scalable, and efficient framework to achieve cross-modal alignment\nfor compositional video generation on the fly."}
{"id": "2510.08352", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.08352", "abs": "https://arxiv.org/abs/2510.08352", "authors": ["Nikos Theodoridis", "Tim Brophy", "Reenu Mohandas", "Ganesh Sistu", "Fiachra Collins", "Anthony Scanlan", "Ciaran Eising"], "title": "Evaluating Small Vision-Language Models on Distance-Dependent Traffic Perception", "comment": null, "summary": "Vision-Language Models (VLMs) are becoming increasingly powerful,\ndemonstrating strong performance on a variety of tasks that require both visual\nand textual understanding. Their strong generalisation abilities make them a\npromising component for automated driving systems, which must handle unexpected\ncorner cases. However, to be trusted in such safety-critical applications, a\nmodel must first possess a reliable perception system. Moreover, since critical\nobjects and agents in traffic scenes are often at a distance, we require\nsystems that are not \"shortsighted\", i.e., systems with strong perception\ncapabilities at both close (up to 20 meters) and long (30+ meters) range. With\nthis in mind, we introduce Distance-Annotated Traffic Perception Question\nAnswering (DTPQA), the first Visual Question Answering (VQA) benchmark focused\nsolely on perception-based questions in traffic scenes, enriched with distance\nannotations. By excluding questions that require reasoning, we ensure that\nmodel performance reflects perception capabilities alone. Since automated\ndriving hardware has limited processing power and cannot support large VLMs,\nour study centers on smaller VLMs. More specifically, we evaluate several\nstate-of-the-art (SOTA) small VLMs on DTPQA and show that, despite the\nsimplicity of the questions, these models significantly underperform compared\nto humans (~60% average accuracy for the best-performing small VLM versus ~85%\nhuman performance). However, it is important to note that the human sample size\nwas relatively small, which imposes statistical limitations. We also identify\nspecific perception tasks, such as distinguishing left from right, that remain\nparticularly challenging for these models."}
{"id": "2510.08278", "categories": ["cs.CV", "cs.HC", "cs.RO"], "pdf": "https://arxiv.org/pdf/2510.08278", "abs": "https://arxiv.org/abs/2510.08278", "authors": ["Fevziye Irem Eyiokur", "Dogucan Yaman", "Hazım Kemal Ekenel", "Alexander Waibel"], "title": "A Multimodal Depth-Aware Method For Embodied Reference Understanding", "comment": null, "summary": "Embodied Reference Understanding requires identifying a target object in a\nvisual scene based on both language instructions and pointing cues. While prior\nworks have shown progress in open-vocabulary object detection, they often fail\nin ambiguous scenarios where multiple candidate objects exist in the scene. To\naddress these challenges, we propose a novel ERU framework that jointly\nleverages LLM-based data augmentation, depth-map modality, and a depth-aware\ndecision module. This design enables robust integration of linguistic and\nembodied cues, improving disambiguation in complex or cluttered environments.\nExperimental results on two datasets demonstrate that our approach\nsignificantly outperforms existing baselines, achieving more accurate and\nreliable referent detection."}
{"id": "2510.08470", "categories": ["cs.AI", "cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.08470", "abs": "https://arxiv.org/abs/2510.08470", "authors": ["Bianca-Mihaela Ganescu", "Suchir Salhan", "Andrew Caines", "Paula Buttery"], "title": "Looking to Learn: Token-wise Dynamic Gating for Low-Resource Vision-Language Modelling", "comment": "Accepted to the EMNLP 2025 BabyLM Workshop", "summary": "Training vision-language models on cognitively-plausible amounts of data\nrequires rethinking how models integrate multimodal information. Within the\nconstraints of the Vision track for the BabyLM Challenge 2025, we propose a\nlightweight decoder-based architecture with (1) token-wise dynamic gating for\nadaptive fusion of linguistic and visual cues, (2) feature modulation and\nchannel attention to maximise the utility of limited visual information and (3)\nauxiliary contrastive objectives for visual grounding. Evaluation on five\nbenchmarks (BLiMP, BLiMP Supplement, EWoK, Winoground and VQA) shows\ncompetitive or superior performance to multimodal baselines. More notably, our\ndynamic gate discovers interpretable patterns without explicit supervision,\nfavouring visual cues for content words and linguistic cues for function words.\nWhile we identify limitations in the Challenge constraints, such as the\ninformation bottleneck created by global image embeddings and training\ninstability from the dataset split, our findings establish dynamic gating as a\npowerful tool for efficient multimodal learning, offering both interpretability\nand performance even under severe constraints."}
{"id": "2510.08404", "categories": ["cs.CL", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.08404", "abs": "https://arxiv.org/abs/2510.08404", "authors": ["Noor Ul Zain", "Mohsin Raza", "Ahsan Adeel"], "title": "Single layer tiny Co$^4$ outpaces GPT-2 and GPT-BERT", "comment": null, "summary": "We show that a tiny Co$^4$ machine(Adeel,2025) with a single layer, two\nheads, and 8M parameters, operating at an approximate cost of $O(N)$ (where $N$\nis the number of input tokens), outpaces the BabyLM Challenge baselines GPT-2\n(124M, 12 layers, $O(N^2))$ and GPT-BERT (30M, 12 layers, $O(N^2))$ in just two\nepochs, while both are trained for ten. Co$^4$ achieves orders-of-magnitude\ngreater training efficiency on 10M tokens, demonstrating highly sample\nefficient pretraining. Using the BabyLM challenge evaluation pipeline across\ncomplex benchmarks, Co$^4$ exhibits strong zero-shot and fine-tuning\nperformance on SuperGLUE tasks. Specifically, Co$^4$ outperforms GPT-2 on 5 out\nof 7 zero-shot metrics and 6 out of 7 fine-tuning tasks, and GPT-BERT on 4 out\nof 7 metrics in both cases. These results suggest the need to rethink\nprevailing deep learning paradigms and associated scaling laws."}
{"id": "2510.08316", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.08316", "abs": "https://arxiv.org/abs/2510.08316", "authors": ["Yu Huang", "Zelin Peng", "Changsong Wen", "Xiaokang Yang", "Wei Shen"], "title": "Unlocking 3D Affordance Segmentation with 2D Semantic Knowledge", "comment": "Work in process", "summary": "Affordance segmentation aims to parse 3D objects into functionally distinct\nparts, bridging recognition and interaction for applications in robotic\nmanipulation, embodied AI, and AR. While recent studies leverage visual or\ntextual prompts to guide this process, they often rely on point cloud encoders\nas generic feature extractors, overlooking the intrinsic challenges of 3D data\nsuch as sparsity, noise, and geometric ambiguity. As a result, 3D features\nlearned in isolation frequently lack clear and semantically consistent\nfunctional boundaries. To address this bottleneck, we propose a\nsemantic-grounded learning paradigm that transfers rich semantic knowledge from\nlarge-scale 2D Vision Foundation Models (VFMs) into the 3D domain.\nSpecifically, We introduce Cross-Modal Affinity Transfer (CMAT), a pre-training\nstrategy that aligns a 3D encoder with lifted 2D semantics and jointly\noptimizes reconstruction, affinity, and diversity to yield semantically\norganized representations. Building on this backbone, we further design the\nCross-modal Affordance Segmentation Transformer (CAST), which integrates\nmulti-modal prompts with CMAT-pretrained features to generate precise,\nprompt-aware segmentation maps. Extensive experiments on standard benchmarks\ndemonstrate that our framework establishes new state-of-the-art results for 3D\naffordance segmentation."}
{"id": "2510.08482", "categories": ["cs.CV", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.08482", "abs": "https://arxiv.org/abs/2510.08482", "authors": ["Onur Keleş", "Aslı Özyürek", "Gerardo Ortega", "Kadir Gökgö", "Esam Ghaleb"], "title": "The Visual Iconicity Challenge: Evaluating Vision-Language Models on Sign Language Form-Meaning Mapping", "comment": null, "summary": "Iconicity, the resemblance between linguistic form and meaning, is pervasive\nin signed languages, offering a natural testbed for visual grounding. For\nvision-language models (VLMs), the challenge is to recover such essential\nmappings from dynamic human motion rather than static context. We introduce the\n\\textit{Visual Iconicity Challenge}, a novel video-based benchmark that adapts\npsycholinguistic measures to evaluate VLMs on three tasks: (i) phonological\nsign-form prediction (e.g., handshape, location), (ii) transparency (inferring\nmeaning from visual form), and (iii) graded iconicity ratings. We assess $13$\nstate-of-the-art VLMs in zero- and few-shot settings on Sign Language of the\nNetherlands and compare them to human baselines. On \\textit{phonological form\nprediction}, VLMs recover some handshape and location detail but remain below\nhuman performance; on \\textit{transparency}, they are far from human baselines;\nand only top models correlate moderately with human \\textit{iconicity ratings}.\nInterestingly, \\textit{models with stronger phonological form prediction\ncorrelate better with human iconicity judgment}, indicating shared sensitivity\nto visually grounded structure. Our findings validate these diagnostic tasks\nand motivate human-centric signals and embodied learning methods for modelling\niconicity and improving visual grounding in multimodal models."}
{"id": "2510.08442", "categories": ["cs.CV", "cs.AI", "cs.RO"], "pdf": "https://arxiv.org/pdf/2510.08442", "abs": "https://arxiv.org/abs/2510.08442", "authors": ["Andrew Lee", "Ian Chuang", "Dechen Gao", "Kai Fukazawa", "Iman Soltani"], "title": "Gaze on the Prize: Shaping Visual Attention with Return-Guided Contrastive Learning", "comment": "Project page: https://andrewcwlee.github.io/gaze-on-the-prize", "summary": "Visual Reinforcement Learning (RL) agents must learn to act based on\nhigh-dimensional image data where only a small fraction of the pixels is\ntask-relevant. This forces agents to waste exploration and computational\nresources on irrelevant features, leading to sample-inefficient and unstable\nlearning. To address this, inspired by human visual foveation, we introduce\nGaze on the Prize. This framework augments visual RL with a learnable foveal\nattention mechanism (Gaze), guided by a self-supervised signal derived from the\nagent's experience pursuing higher returns (the Prize). Our key insight is that\nreturn differences reveal what matters most: If two similar representations\nproduce different outcomes, their distinguishing features are likely\ntask-relevant, and the gaze should focus on them accordingly. This is realized\nthrough return-guided contrastive learning that trains the attention to\ndistinguish between the features relevant to success and failure. We group\nsimilar visual representations into positives and negatives based on their\nreturn differences and use the resulting labels to construct contrastive\ntriplets. These triplets provide the training signal that teaches the attention\nmechanism to produce distinguishable representations for states associated with\ndifferent outcomes. Our method achieves up to 2.4x improvement in sample\nefficiency and can solve tasks that the baseline fails to learn, demonstrated\nacross a suite of manipulation tasks from the ManiSkill3 benchmark, all without\nmodifying the underlying algorithm or hyperparameters."}
{"id": "2510.08352", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.08352", "abs": "https://arxiv.org/abs/2510.08352", "authors": ["Nikos Theodoridis", "Tim Brophy", "Reenu Mohandas", "Ganesh Sistu", "Fiachra Collins", "Anthony Scanlan", "Ciaran Eising"], "title": "Evaluating Small Vision-Language Models on Distance-Dependent Traffic Perception", "comment": null, "summary": "Vision-Language Models (VLMs) are becoming increasingly powerful,\ndemonstrating strong performance on a variety of tasks that require both visual\nand textual understanding. Their strong generalisation abilities make them a\npromising component for automated driving systems, which must handle unexpected\ncorner cases. However, to be trusted in such safety-critical applications, a\nmodel must first possess a reliable perception system. Moreover, since critical\nobjects and agents in traffic scenes are often at a distance, we require\nsystems that are not \"shortsighted\", i.e., systems with strong perception\ncapabilities at both close (up to 20 meters) and long (30+ meters) range. With\nthis in mind, we introduce Distance-Annotated Traffic Perception Question\nAnswering (DTPQA), the first Visual Question Answering (VQA) benchmark focused\nsolely on perception-based questions in traffic scenes, enriched with distance\nannotations. By excluding questions that require reasoning, we ensure that\nmodel performance reflects perception capabilities alone. Since automated\ndriving hardware has limited processing power and cannot support large VLMs,\nour study centers on smaller VLMs. More specifically, we evaluate several\nstate-of-the-art (SOTA) small VLMs on DTPQA and show that, despite the\nsimplicity of the questions, these models significantly underperform compared\nto humans (~60% average accuracy for the best-performing small VLM versus ~85%\nhuman performance). However, it is important to note that the human sample size\nwas relatively small, which imposes statistical limitations. We also identify\nspecific perception tasks, such as distinguishing left from right, that remain\nparticularly challenging for these models."}
{"id": "2510.08510", "categories": ["cs.CV", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.08510", "abs": "https://arxiv.org/abs/2510.08510", "authors": ["Jiayun Luo", "Wan-Cyuan Fan", "Lyuyang Wang", "Xiangteng He", "Tanzila Rahman", "Purang Abolmaesumi", "Leonid Sigal"], "title": "To Sink or Not to Sink: Visual Information Pathways in Large Vision-Language Models", "comment": "Preprint. Project page: https://davidhalladay.github.io/diysink_demo", "summary": "Large Vision Language Models (LVLMs) have recently emerged as powerful\narchitectures capable of understanding and reasoning over both visual and\ntextual information. These models typically rely on two key components: a\nVision Transformer (ViT) and a Large Language Model (LLM). ViT encodes visual\ncontent into a sequence of image tokens and serves as the perceptual front-end\n-- the eyes of the model. In contrast, the LLM interprets these tokens to\nperform high-level reasoning, generates responses, and functions as the\ncognitive core -- the brain of the model. However, it remains unclear which\nvisual tokens contribute most significantly to understanding and reasoning, and\nhow effectively these signals are propagated from ViT to the LLM. While most\nexisting works have focused on identifying attention sinks, low-semantic tokens\nreceiving disproportionately high attention, within the LLM, we shift the focus\nto the vision encoder by identifying a class of high-norm visual tokens from\nViT, referred to as ViT attention sinks -- a problem that has been rarely\nstudied but is indeed very important for LVLMs. Our findings show that these\nViT sinks encapsulate high-level semantic concepts from images, allowing the\nLLM to perform more effective understanding and reasoning. Despite their\nimportance, these sink tokens are often overlooked in existing LVLM\narchitectures. To explore their contribution, we present both qualitative and\nquantitative analyses of the information embedded in these sink tokens. We also\npropose both training-free and training-based approaches to better leverage how\nthis information is interpreted by the LLM, and to what extent. By explicitly\nutilizing these tokens, we demonstrate substantial improvements across a range\nof LVLMs and visual reasoning tasks, highlighting the untapped potential of ViT\nattention sinks in enhancing visual reasoning."}
{"id": "2510.08510", "categories": ["cs.CV", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.08510", "abs": "https://arxiv.org/abs/2510.08510", "authors": ["Jiayun Luo", "Wan-Cyuan Fan", "Lyuyang Wang", "Xiangteng He", "Tanzila Rahman", "Purang Abolmaesumi", "Leonid Sigal"], "title": "To Sink or Not to Sink: Visual Information Pathways in Large Vision-Language Models", "comment": "Preprint. Project page: https://davidhalladay.github.io/diysink_demo", "summary": "Large Vision Language Models (LVLMs) have recently emerged as powerful\narchitectures capable of understanding and reasoning over both visual and\ntextual information. These models typically rely on two key components: a\nVision Transformer (ViT) and a Large Language Model (LLM). ViT encodes visual\ncontent into a sequence of image tokens and serves as the perceptual front-end\n-- the eyes of the model. In contrast, the LLM interprets these tokens to\nperform high-level reasoning, generates responses, and functions as the\ncognitive core -- the brain of the model. However, it remains unclear which\nvisual tokens contribute most significantly to understanding and reasoning, and\nhow effectively these signals are propagated from ViT to the LLM. While most\nexisting works have focused on identifying attention sinks, low-semantic tokens\nreceiving disproportionately high attention, within the LLM, we shift the focus\nto the vision encoder by identifying a class of high-norm visual tokens from\nViT, referred to as ViT attention sinks -- a problem that has been rarely\nstudied but is indeed very important for LVLMs. Our findings show that these\nViT sinks encapsulate high-level semantic concepts from images, allowing the\nLLM to perform more effective understanding and reasoning. Despite their\nimportance, these sink tokens are often overlooked in existing LVLM\narchitectures. To explore their contribution, we present both qualitative and\nquantitative analyses of the information embedded in these sink tokens. We also\npropose both training-free and training-based approaches to better leverage how\nthis information is interpreted by the LLM, and to what extent. By explicitly\nutilizing these tokens, we demonstrate substantial improvements across a range\nof LVLMs and visual reasoning tasks, highlighting the untapped potential of ViT\nattention sinks in enhancing visual reasoning."}
{"id": "2510.08377", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.08377", "abs": "https://arxiv.org/abs/2510.08377", "authors": ["Cong Wei", "Quande Liu", "Zixuan Ye", "Qiulin Wang", "Xintao Wang", "Pengfei Wan", "Kun Gai", "Wenhu Chen"], "title": "UniVideo: Unified Understanding, Generation, and Editing for Videos", "comment": "Project Website https://congwei1230.github.io/UniVideo/", "summary": "Unified multimodal models have shown promising results in multimodal content\ngeneration and editing but remain largely limited to the image domain. In this\nwork, we present UniVideo, a versatile framework that extends unified modeling\nto the video domain. UniVideo adopts a dual-stream design, combining a\nMultimodal Large Language Model (MLLM) for instruction understanding with a\nMultimodal DiT (MMDiT) for video generation. This design enables accurate\ninterpretation of complex multimodal instructions while preserving visual\nconsistency. Built on this architecture, UniVideo unifies diverse video\ngeneration and editing tasks under a single multimodal instruction paradigm and\nis jointly trained across them. Extensive experiments demonstrate that UniVideo\nmatches or surpasses state-of-the-art task-specific baselines in\ntext/image-to-video generation, in-context video generation and in-context\nvideo editing. Notably, the unified design of UniVideo enables two forms of\ngeneralization. First, UniVideo supports task composition, such as combining\nediting with style transfer, by integrating multiple capabilities within a\nsingle instruction. Second, even without explicit training on free-form video\nediting, UniVideo transfers its editing capability from large-scale image\nediting data to this setting, handling unseen instructions such as\ngreen-screening characters or changing materials within a video. Beyond these\ncore capabilities, UniVideo also supports visual-prompt-based video generation,\nwhere the MLLM interprets visual prompts and guides the MMDiT during synthesis.\nTo foster future research, we will release our model and code."}
{"id": "2510.08531", "categories": ["cs.CV", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.08531", "abs": "https://arxiv.org/abs/2510.08531", "authors": ["Hongxing Li", "Dingming Li", "Zixuan Wang", "Yuchen Yan", "Hang Wu", "Wenqi Zhang", "Yongliang Shen", "Weiming Lu", "Jun Xiao", "Yueting Zhuang"], "title": "SpatialLadder: Progressive Training for Spatial Reasoning in Vision-Language Models", "comment": "Project Page: https://zju-real.github.io/SpatialLadder/ Code:\n  https://github.com/ZJU-REAL/SpatialLadder", "summary": "Spatial reasoning remains a fundamental challenge for Vision-Language Models\n(VLMs), with current approaches struggling to achieve robust performance\ndespite recent advances. We identify that this limitation stems from a critical\ngap: existing methods attempt to learn spatial reasoning directly without\nestablishing the hierarchical foundations of perception and understanding. To\naddress this challenge, we present a comprehensive methodology for building\nspatial intelligence progressively. We introduce SpatialLadder-26k, a\nmultimodal dataset containing 26,610 samples spanning object localization,\nsingle image, multi-view, and video spatial reasoning tasks, constructed\nthrough a standardized pipeline that ensures systematic coverage across\nmodalities. Building on this dataset, we design a three-stage progressive\ntraining framework that (1) establishes spatial perception through object\nlocalization, (2) develops spatial understanding through multi-dimensional\nspatial tasks, and (3) strengthens complex reasoning via reinforcement learning\nwith verifiable rewards. This approach yields SpatialLadder, a 3B-parameter\nmodel that achieves state-of-the-art performance on spatial reasoning\nbenchmarks, with 23.4% average improvement over the base model, surpassing\nGPT-4o by 20.8% and Gemini-2.0-Flash by 10.1%. Notably, SpatialLadder maintains\nstrong generalization with 7.2% improvement on out-of-domain benchmarks,\ndemonstrating that progressive training from perception to reasoning is\nessential for robust spatial intelligence."}
{"id": "2510.08531", "categories": ["cs.CV", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.08531", "abs": "https://arxiv.org/abs/2510.08531", "authors": ["Hongxing Li", "Dingming Li", "Zixuan Wang", "Yuchen Yan", "Hang Wu", "Wenqi Zhang", "Yongliang Shen", "Weiming Lu", "Jun Xiao", "Yueting Zhuang"], "title": "SpatialLadder: Progressive Training for Spatial Reasoning in Vision-Language Models", "comment": "Project Page: https://zju-real.github.io/SpatialLadder/ Code:\n  https://github.com/ZJU-REAL/SpatialLadder", "summary": "Spatial reasoning remains a fundamental challenge for Vision-Language Models\n(VLMs), with current approaches struggling to achieve robust performance\ndespite recent advances. We identify that this limitation stems from a critical\ngap: existing methods attempt to learn spatial reasoning directly without\nestablishing the hierarchical foundations of perception and understanding. To\naddress this challenge, we present a comprehensive methodology for building\nspatial intelligence progressively. We introduce SpatialLadder-26k, a\nmultimodal dataset containing 26,610 samples spanning object localization,\nsingle image, multi-view, and video spatial reasoning tasks, constructed\nthrough a standardized pipeline that ensures systematic coverage across\nmodalities. Building on this dataset, we design a three-stage progressive\ntraining framework that (1) establishes spatial perception through object\nlocalization, (2) develops spatial understanding through multi-dimensional\nspatial tasks, and (3) strengthens complex reasoning via reinforcement learning\nwith verifiable rewards. This approach yields SpatialLadder, a 3B-parameter\nmodel that achieves state-of-the-art performance on spatial reasoning\nbenchmarks, with 23.4% average improvement over the base model, surpassing\nGPT-4o by 20.8% and Gemini-2.0-Flash by 10.1%. Notably, SpatialLadder maintains\nstrong generalization with 7.2% improvement on out-of-domain benchmarks,\ndemonstrating that progressive training from perception to reasoning is\nessential for robust spatial intelligence."}
{"id": "2510.08398", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.08398", "abs": "https://arxiv.org/abs/2510.08398", "authors": ["Zeqing Wang", "Xinyu Wei", "Bairui Li", "Zhen Guo", "Jinrui Zhang", "Hongyang Wei", "Keze Wang", "Lei Zhang"], "title": "VideoVerse: How Far is Your T2V Generator from a World Model?", "comment": "24 Pages, 8 Figures, 11 Tables", "summary": "The recent rapid advancement of Text-to-Video (T2V) generation technologies,\nwhich are critical to build ``world models'', makes the existing benchmarks\nincreasingly insufficient to evaluate state-of-the-art T2V models. First,\ncurrent evaluation dimensions, such as per-frame aesthetic quality and temporal\nconsistency, are no longer able to differentiate state-of-the-art T2V models.\nSecond, event-level temporal causality, which not only distinguishes video from\nother modalities but also constitutes a crucial component of world models, is\nseverely underexplored in existing benchmarks. Third, existing benchmarks lack\na systematic assessment of world knowledge, which are essential capabilities\nfor building world models. To address these issues, we introduce VideoVerse, a\ncomprehensive benchmark that focuses on evaluating whether a T2V model could\nunderstand complex temporal causality and world knowledge in the real world. We\ncollect representative videos across diverse domains (e.g., natural landscapes,\nsports, indoor scenes, science fiction, chemical and physical experiments) and\nextract their event-level descriptions with inherent temporal causality, which\nare then rewritten into text-to-video prompts by independent annotators. For\neach prompt, we design a suite of binary evaluation questions from the\nperspective of dynamic and static properties, with a total of ten carefully\ndefined evaluation dimensions. In total, our VideoVerse comprises 300 carefully\ncurated prompts, involving 815 events and 793 binary evaluation questions.\nConsequently, a human preference aligned QA-based evaluation pipeline is\ndeveloped by using modern vision-language models. Finally, we perform a\nsystematic evaluation of state-of-the-art open-source and closed-source T2V\nmodels on VideoVerse, providing in-depth analysis on how far the current T2V\ngenerators are from world models."}
{"id": "2510.08543", "categories": ["cs.CV", "cs.AI", "cs.CL", "cs.CY"], "pdf": "https://arxiv.org/pdf/2510.08543", "abs": "https://arxiv.org/abs/2510.08543", "authors": ["Nikhil Reddy Varimalla", "Yunfei Xu", "Arkadiy Saakyan", "Meng Fan Wang", "Smaranda Muresan"], "title": "VideoNorms: Benchmarking Cultural Awareness of Video Language Models", "comment": "24 pages, 5 figures, under review", "summary": "As Video Large Language Models (VideoLLMs) are deployed globally, they\nrequire understanding of and grounding in the relevant cultural background. To\nproperly assess these models' cultural awareness, adequate benchmarks are\nneeded. We introduce VideoNorms, a benchmark of over 1000 (video clip, norm)\npairs from US and Chinese cultures annotated with socio-cultural norms grounded\nin speech act theory, norm adherence and violations labels, and verbal and\nnon-verbal evidence. To build VideoNorms, we use a human-AI collaboration\nframework, where a teacher model using theoretically-grounded prompting\nprovides candidate annotations and a set of trained human experts validate and\ncorrect the annotations. We benchmark a variety of open-weight VideoLLMs on the\nnew dataset which highlight several common trends: 1) models performs worse on\nnorm violation than adherence; 2) models perform worse w.r.t Chinese culture\ncompared to the US culture; 3) models have more difficulty in providing\nnon-verbal evidence compared to verbal for the norm adhere/violation label and\nstruggle to identify the exact norm corresponding to a speech-act; and 4)\nunlike humans, models perform worse in formal, non-humorous contexts. Our\nfindings emphasize the need for culturally-grounded video language model\ntraining - a gap our benchmark and framework begin to address."}
{"id": "2510.08543", "categories": ["cs.CV", "cs.AI", "cs.CL", "cs.CY"], "pdf": "https://arxiv.org/pdf/2510.08543", "abs": "https://arxiv.org/abs/2510.08543", "authors": ["Nikhil Reddy Varimalla", "Yunfei Xu", "Arkadiy Saakyan", "Meng Fan Wang", "Smaranda Muresan"], "title": "VideoNorms: Benchmarking Cultural Awareness of Video Language Models", "comment": "24 pages, 5 figures, under review", "summary": "As Video Large Language Models (VideoLLMs) are deployed globally, they\nrequire understanding of and grounding in the relevant cultural background. To\nproperly assess these models' cultural awareness, adequate benchmarks are\nneeded. We introduce VideoNorms, a benchmark of over 1000 (video clip, norm)\npairs from US and Chinese cultures annotated with socio-cultural norms grounded\nin speech act theory, norm adherence and violations labels, and verbal and\nnon-verbal evidence. To build VideoNorms, we use a human-AI collaboration\nframework, where a teacher model using theoretically-grounded prompting\nprovides candidate annotations and a set of trained human experts validate and\ncorrect the annotations. We benchmark a variety of open-weight VideoLLMs on the\nnew dataset which highlight several common trends: 1) models performs worse on\nnorm violation than adherence; 2) models perform worse w.r.t Chinese culture\ncompared to the US culture; 3) models have more difficulty in providing\nnon-verbal evidence compared to verbal for the norm adhere/violation label and\nstruggle to identify the exact norm corresponding to a speech-act; and 4)\nunlike humans, models perform worse in formal, non-humorous contexts. Our\nfindings emphasize the need for culturally-grounded video language model\ntraining - a gap our benchmark and framework begin to address."}
{"id": "2510.08431", "categories": ["cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.08431", "abs": "https://arxiv.org/abs/2510.08431", "authors": ["Kaiwen Zheng", "Yuji Wang", "Qianli Ma", "Huayu Chen", "Jintao Zhang", "Yogesh Balaji", "Jianfei Chen", "Ming-Yu Liu", "Jun Zhu", "Qinsheng Zhang"], "title": "Large Scale Diffusion Distillation via Score-Regularized Continuous-Time Consistency", "comment": null, "summary": "This work represents the first effort to scale up continuous-time consistency\ndistillation to general application-level image and video diffusion models.\nAlthough continuous-time consistency model (sCM) is theoretically principled\nand empirically powerful for accelerating academic-scale diffusion, its\napplicability to large-scale text-to-image and video tasks remains unclear due\nto infrastructure challenges in Jacobian-vector product (JVP) computation and\nthe limitations of standard evaluation benchmarks. We first develop a\nparallelism-compatible FlashAttention-2 JVP kernel, enabling sCM training on\nmodels with over 10 billion parameters and high-dimensional video tasks. Our\ninvestigation reveals fundamental quality limitations of sCM in fine-detail\ngeneration, which we attribute to error accumulation and the \"mode-covering\"\nnature of its forward-divergence objective. To remedy this, we propose the\nscore-regularized continuous-time consistency model (rCM), which incorporates\nscore distillation as a long-skip regularizer. This integration complements sCM\nwith the \"mode-seeking\" reverse divergence, effectively improving visual\nquality while maintaining high generation diversity. Validated on large-scale\nmodels (Cosmos-Predict2, Wan2.1) up to 14B parameters and 5-second videos, rCM\nmatches or surpasses the state-of-the-art distillation method DMD2 on quality\nmetrics while offering notable advantages in diversity, all without GAN tuning\nor extensive hyperparameter searches. The distilled models generate\nhigh-fidelity samples in only $1\\sim4$ steps, accelerating diffusion sampling\nby $15\\times\\sim50\\times$. These results position rCM as a practical and\ntheoretically grounded framework for advancing large-scale diffusion\ndistillation."}
{"id": "2510.08567", "categories": ["cs.CV", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.08567", "abs": "https://arxiv.org/abs/2510.08567", "authors": ["Tajamul Ashraf", "Umair Nawaz", "Abdelrahman M. Shaker", "Rao Anwer", "Philip Torr", "Fahad Shahbaz Khan", "Salman Khan"], "title": "MATRIX: Multimodal Agent Tuning for Robust Tool-Use Reasoning", "comment": null, "summary": "Vision language models (VLMs) are increasingly deployed as controllers with\naccess to external tools for complex reasoning and decision-making, yet their\neffectiveness remains limited by the scarcity of high-quality multimodal\ntrajectories and the cost of manual annotation. We address this challenge with\na vision-centric agent tuning framework that automatically synthesizes\nmultimodal trajectories, generates step-wise preference pairs, and trains a VLM\ncontroller for robust tool-use reasoning. Our pipeline first constructs\nM-TRACE, a large-scale dataset of 28.5K multimodal tasks with 177K verified\ntrajectories, enabling imitation-based trajectory tuning. Building on this, we\ndevelop MATRIX Agent, a controller finetuned on M-TRACE for step-wise tool\nreasoning. To achieve finer alignment, we further introduce Pref-X, a set of\n11K automatically generated preference pairs, and optimize MATRIX on it via\nstep-wise preference learning. Across three benchmarks, Agent-X, GTA, and GAIA,\nMATRIX consistently surpasses both open- and closed-source VLMs, demonstrating\nscalable and effective multimodal tool use. Our data and code is avaliable at\nhttps://github.com/mbzuai-oryx/MATRIX."}
{"id": "2510.08559", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.08559", "abs": "https://arxiv.org/abs/2510.08559", "authors": ["Andong Deng", "Taojiannan Yang", "Shoubin Yu", "Lincoln Spencer", "Mohit Bansal", "Chen Chen", "Serena Yeung-Levy", "Xiaohan Wang"], "title": "SciVideoBench: Benchmarking Scientific Video Reasoning in Large Multimodal Models", "comment": null, "summary": "Large Multimodal Models (LMMs) have achieved remarkable progress across\nvarious capabilities; however, complex video reasoning in the scientific domain\nremains a significant and challenging frontier. Current video benchmarks\npredominantly target general scenarios where perception/recognition is heavily\nrelied on, while with relatively simple reasoning tasks, leading to saturation\nand thus failing to effectively evaluate advanced multimodal cognitive skills.\nTo address this critical gap, we introduce SciVideoBench, a rigorous benchmark\nspecifically designed to assess advanced video reasoning in scientific\ncontexts. SciVideoBench consists of 1,000 carefully crafted multiple-choice\nquestions derived from cutting-edge scientific experimental videos spanning\nover 25 specialized academic subjects and verified by a semi-automatic system.\nEach question demands sophisticated domain-specific knowledge, precise\nspatiotemporal perception, and intricate logical reasoning, effectively\nchallenging models' higher-order cognitive abilities. Our evaluation highlights\nsignificant performance deficits in state-of-the-art proprietary and\nopen-source LMMs, including Gemini 2.5 Pro and Qwen2.5-VL, indicating\nsubstantial room for advancement in video reasoning capabilities. Detailed\nanalyses of critical factors such as reasoning complexity and visual grounding\nprovide valuable insights and clear direction for future developments in LMMs,\ndriving the evolution of truly capable multimodal AI co-scientists. We hope\nSciVideoBench could fit the interests of the community and help to push the\nboundary of cutting-edge AI for border science."}
{"id": "2510.08442", "categories": ["cs.CV", "cs.AI", "cs.RO"], "pdf": "https://arxiv.org/pdf/2510.08442", "abs": "https://arxiv.org/abs/2510.08442", "authors": ["Andrew Lee", "Ian Chuang", "Dechen Gao", "Kai Fukazawa", "Iman Soltani"], "title": "Gaze on the Prize: Shaping Visual Attention with Return-Guided Contrastive Learning", "comment": "Project page: https://andrewcwlee.github.io/gaze-on-the-prize", "summary": "Visual Reinforcement Learning (RL) agents must learn to act based on\nhigh-dimensional image data where only a small fraction of the pixels is\ntask-relevant. This forces agents to waste exploration and computational\nresources on irrelevant features, leading to sample-inefficient and unstable\nlearning. To address this, inspired by human visual foveation, we introduce\nGaze on the Prize. This framework augments visual RL with a learnable foveal\nattention mechanism (Gaze), guided by a self-supervised signal derived from the\nagent's experience pursuing higher returns (the Prize). Our key insight is that\nreturn differences reveal what matters most: If two similar representations\nproduce different outcomes, their distinguishing features are likely\ntask-relevant, and the gaze should focus on them accordingly. This is realized\nthrough return-guided contrastive learning that trains the attention to\ndistinguish between the features relevant to success and failure. We group\nsimilar visual representations into positives and negatives based on their\nreturn differences and use the resulting labels to construct contrastive\ntriplets. These triplets provide the training signal that teaches the attention\nmechanism to produce distinguishable representations for states associated with\ndifferent outcomes. Our method achieves up to 2.4x improvement in sample\nefficiency and can solve tasks that the baseline fails to learn, demonstrated\nacross a suite of manipulation tasks from the ManiSkill3 benchmark, all without\nmodifying the underlying algorithm or hyperparameters."}
{"id": "2510.08567", "categories": ["cs.CV", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.08567", "abs": "https://arxiv.org/abs/2510.08567", "authors": ["Tajamul Ashraf", "Umair Nawaz", "Abdelrahman M. Shaker", "Rao Anwer", "Philip Torr", "Fahad Shahbaz Khan", "Salman Khan"], "title": "MATRIX: Multimodal Agent Tuning for Robust Tool-Use Reasoning", "comment": null, "summary": "Vision language models (VLMs) are increasingly deployed as controllers with\naccess to external tools for complex reasoning and decision-making, yet their\neffectiveness remains limited by the scarcity of high-quality multimodal\ntrajectories and the cost of manual annotation. We address this challenge with\na vision-centric agent tuning framework that automatically synthesizes\nmultimodal trajectories, generates step-wise preference pairs, and trains a VLM\ncontroller for robust tool-use reasoning. Our pipeline first constructs\nM-TRACE, a large-scale dataset of 28.5K multimodal tasks with 177K verified\ntrajectories, enabling imitation-based trajectory tuning. Building on this, we\ndevelop MATRIX Agent, a controller finetuned on M-TRACE for step-wise tool\nreasoning. To achieve finer alignment, we further introduce Pref-X, a set of\n11K automatically generated preference pairs, and optimize MATRIX on it via\nstep-wise preference learning. Across three benchmarks, Agent-X, GTA, and GAIA,\nMATRIX consistently surpasses both open- and closed-source VLMs, demonstrating\nscalable and effective multimodal tool use. Our data and code is avaliable at\nhttps://github.com/mbzuai-oryx/MATRIX."}
{"id": "2510.08480", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.08480", "abs": "https://arxiv.org/abs/2510.08480", "authors": ["Zhenlong Yuan", "Xiangyan Qu", "Chengxuan Qian", "Rui Chen", "Jing Tang", "Lei Sun", "Xiangxiang Chu", "Dapeng Zhang", "Yiwei Wang", "Yujun Cai", "Shuo Li"], "title": "Video-STAR: Reinforcing Open-Vocabulary Action Recognition with Tools", "comment": null, "summary": "Multimodal large language models (MLLMs) have demonstrated remarkable\npotential in bridging visual and textual reasoning, yet their reliance on\ntext-centric priors often limits their ability to disentangle semantically\nsimilar actions in open-vocabulary scenarios. To address this, we propose\nVideo-STAR, a framework that harmonizes contextual sub-motion decomposition\nwith tool-augmented reinforcement learning for open-vocabulary action\nrecognition (OVAR). Unlike prior methods that treat actions as monolithic\nentities, our approach innovatively decomposes actions into discriminative\nsub-motions for fine-grained matching while dynamically invoking\ndomain-specific tools for cross-modal interleaving, thereby enabling\ncategory-specific reasoning capacity and reducing cross-modal hallucination.\nMoreover, by designing a hierarchical reward that balances tool-usage\nefficiency, sub-motion relevance, and structural coherence in reasoning, our\nmethod autonomously leverages external tools to prioritize sub-motion patterns\nwithout explicit supervision, transmitting from text-centric reasoning to\nvisually grounded inference. Extensive evaluations on HMDB-51, UCF-101, SSv2,\nKinetics-400, and Kinetics-600 datasets demonstrate our state-of-the-art\nperformance, outperforming existing methods in distinguishing fine-grained\nactions and handling cross-modal hallucination, validating our excellent\nrobustness and generalization."}
{"id": "2510.08482", "categories": ["cs.CV", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.08482", "abs": "https://arxiv.org/abs/2510.08482", "authors": ["Onur Keleş", "Aslı Özyürek", "Gerardo Ortega", "Kadir Gökgö", "Esam Ghaleb"], "title": "The Visual Iconicity Challenge: Evaluating Vision-Language Models on Sign Language Form-Meaning Mapping", "comment": null, "summary": "Iconicity, the resemblance between linguistic form and meaning, is pervasive\nin signed languages, offering a natural testbed for visual grounding. For\nvision-language models (VLMs), the challenge is to recover such essential\nmappings from dynamic human motion rather than static context. We introduce the\n\\textit{Visual Iconicity Challenge}, a novel video-based benchmark that adapts\npsycholinguistic measures to evaluate VLMs on three tasks: (i) phonological\nsign-form prediction (e.g., handshape, location), (ii) transparency (inferring\nmeaning from visual form), and (iii) graded iconicity ratings. We assess $13$\nstate-of-the-art VLMs in zero- and few-shot settings on Sign Language of the\nNetherlands and compare them to human baselines. On \\textit{phonological form\nprediction}, VLMs recover some handshape and location detail but remain below\nhuman performance; on \\textit{transparency}, they are far from human baselines;\nand only top models correlate moderately with human \\textit{iconicity ratings}.\nInterestingly, \\textit{models with stronger phonological form prediction\ncorrelate better with human iconicity judgment}, indicating shared sensitivity\nto visually grounded structure. Our findings validate these diagnostic tasks\nand motivate human-centric signals and embodied learning methods for modelling\niconicity and improving visual grounding in multimodal models."}
{"id": "2510.08485", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.08485", "abs": "https://arxiv.org/abs/2510.08485", "authors": ["Chong Mou", "Qichao Sun", "Yanze Wu", "Pengze Zhang", "Xinghui Li", "Fulong Ye", "Songtao Zhao", "Qian He"], "title": "InstructX: Towards Unified Visual Editing with MLLM Guidance", "comment": null, "summary": "With recent advances in Multimodal Large Language Models (MLLMs) showing\nstrong visual understanding and reasoning, interest is growing in using them to\nimprove the editing performance of diffusion models. Despite rapid progress,\nmost studies lack an in-depth analysis of MLLM design choices. Moreover, the\nintegration of MLLMs and diffusion models remains an open challenge in some\ndifficult tasks, such as video editing. In this paper, we present InstructX, a\nunified framework for image and video editing. Specifically, we conduct a\ncomprehensive study on integrating MLLMs and diffusion models for\ninstruction-driven editing across diverse tasks. Building on this study, we\nanalyze the cooperation and distinction between images and videos in unified\nmodeling. (1) We show that training on image data can lead to emergent video\nediting capabilities without explicit supervision, thereby alleviating the\nconstraints imposed by scarce video training data. (2) By incorporating\nmodality-specific MLLM features, our approach effectively unifies image and\nvideo editing tasks within a single model. Extensive experiments demonstrate\nthat our method can handle a broad range of image and video editing tasks and\nachieves state-of-the-art performance."}
{"id": "2510.08508", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.08508", "abs": "https://arxiv.org/abs/2510.08508", "authors": ["Lu Liu", "Chunlei Cai", "Shaocheng Shen", "Jianfeng Liang", "Weimin Ouyang", "Tianxiao Ye", "Jian Mao", "Huiyu Duan", "Jiangchao Yao", "Xiaoyun Zhang", "Qiang Hu", "Guangtao Zhai"], "title": "MoA-VR: A Mixture-of-Agents System Towards All-in-One Video Restoration", "comment": null, "summary": "Real-world videos often suffer from complex degradations, such as noise,\ncompression artifacts, and low-light distortions, due to diverse acquisition\nand transmission conditions. Existing restoration methods typically require\nprofessional manual selection of specialized models or rely on monolithic\narchitectures that fail to generalize across varying degradations. Inspired by\nexpert experience, we propose MoA-VR, the first\n\\underline{M}ixture-\\underline{o}f-\\underline{A}gents \\underline{V}ideo\n\\underline{R}estoration system that mimics the reasoning and processing\nprocedures of human professionals through three coordinated agents: Degradation\nIdentification, Routing and Restoration, and Restoration Quality Assessment.\nSpecifically, we construct a large-scale and high-resolution video degradation\nrecognition benchmark and build a vision-language model (VLM) driven\ndegradation identifier. We further introduce a self-adaptive router powered by\nlarge language models (LLMs), which autonomously learns effective restoration\nstrategies by observing tool usage patterns. To assess intermediate and final\nprocessed video quality, we construct the \\underline{Res}tored\n\\underline{V}ideo \\underline{Q}uality (Res-VQ) dataset and design a dedicated\nVLM-based video quality assessment (VQA) model tailored for restoration tasks.\nExtensive experiments demonstrate that MoA-VR effectively handles diverse and\ncompound degradations, consistently outperforming existing baselines in terms\nof both objective metrics and perceptual quality. These results highlight the\npotential of integrating multimodal intelligence and modular reasoning in\ngeneral-purpose video restoration systems."}
{"id": "2510.08510", "categories": ["cs.CV", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.08510", "abs": "https://arxiv.org/abs/2510.08510", "authors": ["Jiayun Luo", "Wan-Cyuan Fan", "Lyuyang Wang", "Xiangteng He", "Tanzila Rahman", "Purang Abolmaesumi", "Leonid Sigal"], "title": "To Sink or Not to Sink: Visual Information Pathways in Large Vision-Language Models", "comment": "Preprint. Project page: https://davidhalladay.github.io/diysink_demo", "summary": "Large Vision Language Models (LVLMs) have recently emerged as powerful\narchitectures capable of understanding and reasoning over both visual and\ntextual information. These models typically rely on two key components: a\nVision Transformer (ViT) and a Large Language Model (LLM). ViT encodes visual\ncontent into a sequence of image tokens and serves as the perceptual front-end\n-- the eyes of the model. In contrast, the LLM interprets these tokens to\nperform high-level reasoning, generates responses, and functions as the\ncognitive core -- the brain of the model. However, it remains unclear which\nvisual tokens contribute most significantly to understanding and reasoning, and\nhow effectively these signals are propagated from ViT to the LLM. While most\nexisting works have focused on identifying attention sinks, low-semantic tokens\nreceiving disproportionately high attention, within the LLM, we shift the focus\nto the vision encoder by identifying a class of high-norm visual tokens from\nViT, referred to as ViT attention sinks -- a problem that has been rarely\nstudied but is indeed very important for LVLMs. Our findings show that these\nViT sinks encapsulate high-level semantic concepts from images, allowing the\nLLM to perform more effective understanding and reasoning. Despite their\nimportance, these sink tokens are often overlooked in existing LVLM\narchitectures. To explore their contribution, we present both qualitative and\nquantitative analyses of the information embedded in these sink tokens. We also\npropose both training-free and training-based approaches to better leverage how\nthis information is interpreted by the LLM, and to what extent. By explicitly\nutilizing these tokens, we demonstrate substantial improvements across a range\nof LVLMs and visual reasoning tasks, highlighting the untapped potential of ViT\nattention sinks in enhancing visual reasoning."}
{"id": "2510.08531", "categories": ["cs.CV", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.08531", "abs": "https://arxiv.org/abs/2510.08531", "authors": ["Hongxing Li", "Dingming Li", "Zixuan Wang", "Yuchen Yan", "Hang Wu", "Wenqi Zhang", "Yongliang Shen", "Weiming Lu", "Jun Xiao", "Yueting Zhuang"], "title": "SpatialLadder: Progressive Training for Spatial Reasoning in Vision-Language Models", "comment": "Project Page: https://zju-real.github.io/SpatialLadder/ Code:\n  https://github.com/ZJU-REAL/SpatialLadder", "summary": "Spatial reasoning remains a fundamental challenge for Vision-Language Models\n(VLMs), with current approaches struggling to achieve robust performance\ndespite recent advances. We identify that this limitation stems from a critical\ngap: existing methods attempt to learn spatial reasoning directly without\nestablishing the hierarchical foundations of perception and understanding. To\naddress this challenge, we present a comprehensive methodology for building\nspatial intelligence progressively. We introduce SpatialLadder-26k, a\nmultimodal dataset containing 26,610 samples spanning object localization,\nsingle image, multi-view, and video spatial reasoning tasks, constructed\nthrough a standardized pipeline that ensures systematic coverage across\nmodalities. Building on this dataset, we design a three-stage progressive\ntraining framework that (1) establishes spatial perception through object\nlocalization, (2) develops spatial understanding through multi-dimensional\nspatial tasks, and (3) strengthens complex reasoning via reinforcement learning\nwith verifiable rewards. This approach yields SpatialLadder, a 3B-parameter\nmodel that achieves state-of-the-art performance on spatial reasoning\nbenchmarks, with 23.4% average improvement over the base model, surpassing\nGPT-4o by 20.8% and Gemini-2.0-Flash by 10.1%. Notably, SpatialLadder maintains\nstrong generalization with 7.2% improvement on out-of-domain benchmarks,\ndemonstrating that progressive training from perception to reasoning is\nessential for robust spatial intelligence."}
{"id": "2510.08540", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.08540", "abs": "https://arxiv.org/abs/2510.08540", "authors": ["Xiangyu Zhao", "Junming Lin", "Tianhao Liang", "Yifan Zhou", "Wenhao Chai", "Yuzhe Gu", "Weiyun Wang", "Kai Chen", "Gen Luo", "Wenwei Zhang", "Junchi Yan", "Hua Yang", "Haodong Duan", "Xue Yang"], "title": "MM-HELIX: Boosting Multimodal Long-Chain Reflective Reasoning with Holistic Platform and Adaptive Hybrid Policy Optimization", "comment": null, "summary": "While current Multimodal Large Language Models (MLLMs) have demonstrated\nproficiency in reasoning tasks such as mathematics and logic, their capacity\nfor long-chain reflective reasoning, a prerequisite for solving complex\nreal-world problems, remains largely underexplored. In this work, we first\nconduct an extensive empirical investigation to evaluate this capability.\nLeveraging a carefully designed data synthesis engine, we construct MM-HELIX, a\nmultimodal benchmark consisting 1,260 samples of 42 challenging synthetic tasks\nthat require iterative thinking and backtracking. Empirical results on this\nbenchmark reveal that existing MLLMs exhibit significant performance deficits\nin long-chain reflective reasoning. To address this limitation, we generate\npost-training data and further explore learning paradigms for exploiting such\ndata. We first develop the Step-Elicited Response Generation pipeline to create\nMM-HELIX-100K, a large-scale dataset of 100k high-quality, reflective reasoning\ntraces for instruction-tuning stage. Given that standard Reinforcement Learning\nfails on complex tasks due to sparse reward signals and catastrophic forgetting\nafter Supervised Fine-Tuning, we propose Adaptive Hybrid Policy Optimization\n(AHPO), a novel training strategy that dynamically unifies offline supervision\nand online optimization into a single stage. This strategy enables the model to\nlearn from expert data when rewards are sparse and conduct independent\nexploration once proficient. When applied to the Qwen2.5-VL-7B baseline, our\nmethod achieves a +18.6\\% accuracy improvement on MM-HELIX benchmark and\ndemonstrates strong generalization with a +5.7\\% average performance gain on\ngeneral mathematic and logic tasks. Our work demonstrate that reflective\nreasoning in MLLMs can be effectively learned and generalized, paving the way\nfor developing more capable MLLMs."}
{"id": "2510.08543", "categories": ["cs.CV", "cs.AI", "cs.CL", "cs.CY"], "pdf": "https://arxiv.org/pdf/2510.08543", "abs": "https://arxiv.org/abs/2510.08543", "authors": ["Nikhil Reddy Varimalla", "Yunfei Xu", "Arkadiy Saakyan", "Meng Fan Wang", "Smaranda Muresan"], "title": "VideoNorms: Benchmarking Cultural Awareness of Video Language Models", "comment": "24 pages, 5 figures, under review", "summary": "As Video Large Language Models (VideoLLMs) are deployed globally, they\nrequire understanding of and grounding in the relevant cultural background. To\nproperly assess these models' cultural awareness, adequate benchmarks are\nneeded. We introduce VideoNorms, a benchmark of over 1000 (video clip, norm)\npairs from US and Chinese cultures annotated with socio-cultural norms grounded\nin speech act theory, norm adherence and violations labels, and verbal and\nnon-verbal evidence. To build VideoNorms, we use a human-AI collaboration\nframework, where a teacher model using theoretically-grounded prompting\nprovides candidate annotations and a set of trained human experts validate and\ncorrect the annotations. We benchmark a variety of open-weight VideoLLMs on the\nnew dataset which highlight several common trends: 1) models performs worse on\nnorm violation than adherence; 2) models perform worse w.r.t Chinese culture\ncompared to the US culture; 3) models have more difficulty in providing\nnon-verbal evidence compared to verbal for the norm adhere/violation label and\nstruggle to identify the exact norm corresponding to a speech-act; and 4)\nunlike humans, models perform worse in formal, non-humorous contexts. Our\nfindings emphasize the need for culturally-grounded video language model\ntraining - a gap our benchmark and framework begin to address."}
{"id": "2510.08559", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.08559", "abs": "https://arxiv.org/abs/2510.08559", "authors": ["Andong Deng", "Taojiannan Yang", "Shoubin Yu", "Lincoln Spencer", "Mohit Bansal", "Chen Chen", "Serena Yeung-Levy", "Xiaohan Wang"], "title": "SciVideoBench: Benchmarking Scientific Video Reasoning in Large Multimodal Models", "comment": null, "summary": "Large Multimodal Models (LMMs) have achieved remarkable progress across\nvarious capabilities; however, complex video reasoning in the scientific domain\nremains a significant and challenging frontier. Current video benchmarks\npredominantly target general scenarios where perception/recognition is heavily\nrelied on, while with relatively simple reasoning tasks, leading to saturation\nand thus failing to effectively evaluate advanced multimodal cognitive skills.\nTo address this critical gap, we introduce SciVideoBench, a rigorous benchmark\nspecifically designed to assess advanced video reasoning in scientific\ncontexts. SciVideoBench consists of 1,000 carefully crafted multiple-choice\nquestions derived from cutting-edge scientific experimental videos spanning\nover 25 specialized academic subjects and verified by a semi-automatic system.\nEach question demands sophisticated domain-specific knowledge, precise\nspatiotemporal perception, and intricate logical reasoning, effectively\nchallenging models' higher-order cognitive abilities. Our evaluation highlights\nsignificant performance deficits in state-of-the-art proprietary and\nopen-source LMMs, including Gemini 2.5 Pro and Qwen2.5-VL, indicating\nsubstantial room for advancement in video reasoning capabilities. Detailed\nanalyses of critical factors such as reasoning complexity and visual grounding\nprovide valuable insights and clear direction for future developments in LMMs,\ndriving the evolution of truly capable multimodal AI co-scientists. We hope\nSciVideoBench could fit the interests of the community and help to push the\nboundary of cutting-edge AI for border science."}
{"id": "2510.08561", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.08561", "abs": "https://arxiv.org/abs/2510.08561", "authors": ["Maham Tanveer", "Yang Zhou", "Simon Niklaus", "Ali Mahdavi Amiri", "Hao Zhang", "Krishna Kumar Singh", "Nanxuan Zhao"], "title": "MultiCOIN: Multi-Modal COntrollable Video INbetweening", "comment": "Project website: https://multicoinx.github.io/multicoin/", "summary": "Video inbetweening creates smooth and natural transitions between two image\nframes, making it an indispensable tool for video editing and long-form video\nsynthesis. Existing works in this domain are unable to generate large, complex,\nor intricate motions. In particular, they cannot accommodate the versatility of\nuser intents and generally lack fine control over the details of intermediate\nframes, leading to misalignment with the creative mind. To fill these gaps, we\nintroduce \\modelname{}, a video inbetweening framework that allows multi-modal\ncontrols, including depth transition and layering, motion trajectories, text\nprompts, and target regions for movement localization, while achieving a\nbalance between flexibility, ease of use, and precision for fine-grained video\ninterpolation. To achieve this, we adopt the Diffusion Transformer (DiT)\narchitecture as our video generative model, due to its proven capability to\ngenerate high-quality long videos. To ensure compatibility between DiT and our\nmulti-modal controls, we map all motion controls into a common sparse and\nuser-friendly point-based representation as the video/noise input. Further, to\nrespect the variety of controls which operate at varying levels of granularity\nand influence, we separate content controls and motion controls into two\nbranches to encode the required features before guiding the denoising process,\nresulting in two generators, one for motion and the other for content. Finally,\nwe propose a stage-wise training strategy to ensure that our model learns the\nmulti-modal controls smoothly. Extensive qualitative and quantitative\nexperiments demonstrate that multi-modal controls enable a more dynamic,\ncustomizable, and contextually accurate visual narrative."}
{"id": "2510.08565", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.08565", "abs": "https://arxiv.org/abs/2510.08565", "authors": ["Changyao Tian", "Hao Li", "Gen Luo", "Xizhou Zhu", "Weijie Su", "Hanming Deng", "Jinguo Zhu", "Jie Shao", "Ziran Zhu", "Yunpeng Liu", "Lewei Lu", "Wenhai Wang", "Hongsheng Li", "Jifeng Dai"], "title": "NaViL: Rethinking Scaling Properties of Native Multimodal Large Language Models under Data Constraints", "comment": "Accepted by NeurIPS 2025. 22 pages, link:\n  https://github.com/OpenGVLab/NaViL", "summary": "Compositional training has been the de-facto paradigm in existing Multimodal\nLarge Language Models (MLLMs), where pre-trained vision encoders are connected\nwith pre-trained LLMs through continuous multimodal pre-training. However, the\nmultimodal scaling property of this paradigm remains difficult to explore due\nto the separated training. In this paper, we focus on the native training of\nMLLMs in an end-to-end manner and systematically study its design space and\nscaling property under a practical setting, i.e., data constraint. Through\ncareful study of various choices in MLLM, we obtain the optimal\nmeta-architecture that best balances performance and training cost. After that,\nwe further explore the scaling properties of the native MLLM and indicate the\npositively correlated scaling relationship between visual encoders and LLMs.\nBased on these findings, we propose a native MLLM called NaViL, combined with a\nsimple and cost-effective recipe. Experimental results on 14 multimodal\nbenchmarks confirm the competitive performance of NaViL against existing MLLMs.\nBesides that, our findings and results provide in-depth insights for the future\nstudy of native MLLMs."}
{"id": "2510.08567", "categories": ["cs.CV", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.08567", "abs": "https://arxiv.org/abs/2510.08567", "authors": ["Tajamul Ashraf", "Umair Nawaz", "Abdelrahman M. Shaker", "Rao Anwer", "Philip Torr", "Fahad Shahbaz Khan", "Salman Khan"], "title": "MATRIX: Multimodal Agent Tuning for Robust Tool-Use Reasoning", "comment": null, "summary": "Vision language models (VLMs) are increasingly deployed as controllers with\naccess to external tools for complex reasoning and decision-making, yet their\neffectiveness remains limited by the scarcity of high-quality multimodal\ntrajectories and the cost of manual annotation. We address this challenge with\na vision-centric agent tuning framework that automatically synthesizes\nmultimodal trajectories, generates step-wise preference pairs, and trains a VLM\ncontroller for robust tool-use reasoning. Our pipeline first constructs\nM-TRACE, a large-scale dataset of 28.5K multimodal tasks with 177K verified\ntrajectories, enabling imitation-based trajectory tuning. Building on this, we\ndevelop MATRIX Agent, a controller finetuned on M-TRACE for step-wise tool\nreasoning. To achieve finer alignment, we further introduce Pref-X, a set of\n11K automatically generated preference pairs, and optimize MATRIX on it via\nstep-wise preference learning. Across three benchmarks, Agent-X, GTA, and GAIA,\nMATRIX consistently surpasses both open- and closed-source VLMs, demonstrating\nscalable and effective multimodal tool use. Our data and code is avaliable at\nhttps://github.com/mbzuai-oryx/MATRIX."}
{"id": "2510.07632", "categories": ["cs.AI", "cs.CL", "cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.07632", "abs": "https://arxiv.org/abs/2510.07632", "authors": ["Yinglun Zhu", "Jiancheng Zhang", "Fuzhi Tang"], "title": "Test-Time Matching: Unlocking Compositional Reasoning in Multimodal Models", "comment": null, "summary": "Frontier AI models have achieved remarkable progress, yet recent studies\nsuggest they struggle with compositional reasoning, often performing at or\nbelow random chance on established benchmarks. We revisit this problem and show\nthat widely used evaluation metrics systematically underestimate model\ncapability. To address this, we introduce a group matching score that better\nexploits group structure and reveals substantial hidden capability in both\ncontrastive vision-language models (VLMs) and multimodal large language models\n(MLLMs). Moreover, simply overfitting to the induced group matchings at test\ntime transfers this hidden capability into higher scores under standard\nevaluation metrics, closing much of the reported gap. This adjustment enables\nSigLIP-B16 to surpass all previous results and GPT-4.1 to yield the first\nresult surpassing estimated human performance on Winoground.\n  Building on this insight, we propose Test-Time Matching (TTM), an iterative,\nself-improving algorithm that further bootstraps model performance without any\nexternal supervision. TTM delivers additional, non-trivial improvements: for\nexample, TTM enables SigLIP-B16 to surpass GPT-4.1 on MMVP-VLM, establishing a\nnew state of the art. Importantly, TTM remains broadly effective even on\nbenchmarks without metric-induced effects or group structures, achieving\nrelative gains up to 85.7% on challenging datasets such as WhatsUp. Across 16\ndataset variants spanning diverse setups, our experiments demonstrate that TTM\nconsistently improves model performance and advances the frontier of\ncompositional reasoning."}
{"id": "2510.08564", "categories": ["cs.AI", "cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.08564", "abs": "https://arxiv.org/abs/2510.08564", "authors": ["Zhen Zhu", "Yiming Gong", "Yao Xiao", "Yaoyao Liu", "Derek Hoiem"], "title": "How to Teach Large Multimodal Models New Skills", "comment": "In submission. Code is available at\n  https://github.com/jessemelpolio/LMM_CL", "summary": "How can we teach large multimodal models (LMMs) new skills without erasing\nprior abilities? We study sequential fine-tuning on five target skills while\nmonitoring general ability on eight held-out benchmarks across three model\nfamilies. We observe that apparent \"forgetting\" on held-out tasks after narrow\nfine-tuning can partly recover at later stages. We trace this behavior to a\nmeasurable shift in the output token distribution, manifested through a simple\ncounting-bias probe that co-varies with forgetting. Guided by this picture, we\nidentify two simple, robust tuning recipes that learn strongly while limiting\ndrift: (i) updating only the self-attention projection layers, and (ii)\nupdating only the MLP Gate&Up while freezing the Down projection. Across models\nand tasks, these choices deliver strong target gains while largely preserving\nheld-out performance. Code is available at\nhttps://github.com/jessemelpolio/LMM_CL"}
