{"id": "2512.16259", "categories": ["cs.NE"], "pdf": "https://arxiv.org/pdf/2512.16259", "abs": "https://arxiv.org/abs/2512.16259", "authors": ["Zeyu Huang", "Wei Meng", "Quan Liu", "Kun Chen", "Li Ma"], "title": "Improving Low-Latency Learning Performance in Spiking Neural Networks via a Change-Perceptive Dendrite-Soma-Axon Neuron", "comment": null, "summary": "Spiking neurons, the fundamental information processing units of Spiking Neural Networks (SNNs), have the all-or-zero information output form that allows SNNs to be more energy-efficient compared to Artificial Neural Networks (ANNs). However, the hard reset mechanism employed in spiking neurons leads to information degradation due to its uniform handling of diverse membrane potentials. Furthermore, the utilization of overly simplified neuron models that disregard the intricate biological structures inherently impedes the network's capacity to accurately simulate the actual potential transmission process. To address these issues, we propose a dendrite-soma-axon (DSA) neuron employing the soft reset strategy, in conjunction with a potential change-based perception mechanism, culminating in the change-perceptive dendrite-soma-axon (CP-DSA) neuron. Our model contains multiple learnable parameters that expand the representation space of neurons. The change-perceptive (CP) mechanism enables our model to achieve competitive performance in short time steps utilizing the difference information of adjacent time steps. Rigorous theoretical analysis is provided to demonstrate the efficacy of the CP-DSA model and the functional characteristics of its internal parameters. Furthermore, extensive experiments conducted on various datasets substantiate the significant advantages of the CP-DSA model over state-of-the-art approaches."}
{"id": "2512.16092", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2512.16092", "abs": "https://arxiv.org/abs/2512.16092", "authors": ["Zibin Liu", "Shunkun Liang", "Banglei Guan", "Dongcai Tan", "Yang Shang", "Qifeng Yu"], "title": "Collimator-assisted high-precision calibration method for event cameras", "comment": "4 pages, 3 figures", "summary": "Event cameras are a new type of brain-inspired visual sensor with advantages such as high dynamic range and high temporal resolution. The geometric calibration of event cameras, which involves determining their intrinsic and extrinsic parameters, particularly in long-range measurement scenarios, remains a significant challenge. To address the dual requirements of long-distance and high-precision measurement, we propose an event camera calibration method utilizing a collimator with flickering star-based patterns. The proposed method first linearly solves camera parameters using the sphere motion model of the collimator, followed by nonlinear optimization to refine these parameters with high precision. Through comprehensive real-world experiments across varying conditions, we demonstrate that the proposed method consistently outperforms existing event camera calibration methods in terms of accuracy and reliability."}
{"id": "2512.16872", "categories": ["cs.NE", "cs.LG", "stat.ML"], "pdf": "https://arxiv.org/pdf/2512.16872", "abs": "https://arxiv.org/abs/2512.16872", "authors": ["Shayan Hundrieser", "Philipp Tuchel", "Insung Kong", "Johannes Schmidt-Hieber"], "title": "On the Universal Representation Property of Spiking Neural Networks", "comment": "54 pages, 8 figures", "summary": "Inspired by biology, spiking neural networks (SNNs) process information via discrete spikes over time, offering an energy-efficient alternative to the classical computing paradigm and classical artificial neural networks (ANNs). In this work, we analyze the representational power of SNNs by viewing them as sequence-to-sequence processors of spikes, i.e., systems that transform a stream of input spikes into a stream of output spikes. We establish the universal representation property for a natural class of spike train functions. Our results are fully quantitative, constructive, and near-optimal in the number of required weights and neurons. The analysis reveals that SNNs are particularly well-suited to represent functions with few inputs, low temporal complexity, or compositions of such functions. The latter is of particular interest, as it indicates that deep SNNs can efficiently capture composite functions via a modular design. As an application of our results, we discuss spike train classification. Overall, these results contribute to a rigorous foundation for understanding the capabilities and limitations of spike-based neuromorphic systems."}
{"id": "2512.16178", "categories": ["cs.CV", "cs.AI", "cs.RO"], "pdf": "https://arxiv.org/pdf/2512.16178", "abs": "https://arxiv.org/abs/2512.16178", "authors": ["M. Oltan Sevinc", "Liao Wu", "Francisco Cruz"], "title": "Towards Closing the Domain Gap with Event Cameras", "comment": "Accepted to Australasian Conference on Robotics and Automation (ACRA), 2025", "summary": "Although traditional cameras are the primary sensor for end-to-end driving, their performance suffers greatly when the conditions of the data they were trained on does not match the deployment environment, a problem known as the domain gap. In this work, we consider the day-night lighting difference domain gap. Instead of traditional cameras we propose event cameras as a potential alternative which can maintain performance across lighting condition domain gaps without requiring additional adjustments. Our results show that event cameras maintain more consistent performance across lighting conditions, exhibiting domain-shift penalties that are generally comparable to or smaller than grayscale frames and provide superior baseline performance in cross-domain scenarios."}
{"id": "2512.16178", "categories": ["cs.CV", "cs.AI", "cs.RO"], "pdf": "https://arxiv.org/pdf/2512.16178", "abs": "https://arxiv.org/abs/2512.16178", "authors": ["M. Oltan Sevinc", "Liao Wu", "Francisco Cruz"], "title": "Towards Closing the Domain Gap with Event Cameras", "comment": "Accepted to Australasian Conference on Robotics and Automation (ACRA), 2025", "summary": "Although traditional cameras are the primary sensor for end-to-end driving, their performance suffers greatly when the conditions of the data they were trained on does not match the deployment environment, a problem known as the domain gap. In this work, we consider the day-night lighting difference domain gap. Instead of traditional cameras we propose event cameras as a potential alternative which can maintain performance across lighting condition domain gaps without requiring additional adjustments. Our results show that event cameras maintain more consistent performance across lighting conditions, exhibiting domain-shift penalties that are generally comparable to or smaller than grayscale frames and provide superior baseline performance in cross-domain scenarios."}
