{"id": "2510.21403", "categories": ["cs.NE"], "pdf": "https://arxiv.org/pdf/2510.21403", "abs": "https://arxiv.org/abs/2510.21403", "authors": ["Jieyuan Zhang", "Xiaolong Zhou", "Shuai Wang", "Wenjie Wei", "Hanwen Liu", "Qian Sun", "Malu Zhang", "Yang Yang", "Haizhou Li"], "title": "Unveiling the Spatial-temporal Effective Receptive Fields of Spiking Neural Networks", "comment": "Acceped by 39th Conference on Neural Information Processing Systems\n  (NeurIPS 2025)", "summary": "Spiking Neural Networks (SNNs) demonstrate significant potential for\nenergy-efficient neuromorphic computing through an event-driven paradigm. While\ntraining methods and computational models have greatly advanced, SNNs struggle\nto achieve competitive performance in visual long-sequence modeling tasks. In\nartificial neural networks, the effective receptive field (ERF) serves as a\nvaluable tool for analyzing feature extraction capabilities in visual\nlong-sequence modeling. Inspired by this, we introduce the Spatio-Temporal\nEffective Receptive Field (ST-ERF) to analyze the ERF distributions across\nvarious Transformer-based SNNs. Based on the proposed ST-ERF, we reveal that\nthese models suffer from establishing a robust global ST-ERF, thereby limiting\ntheir visual feature modeling capabilities. To overcome this issue, we propose\ntwo novel channel-mixer architectures:\n\\underline{m}ulti-\\underline{l}ayer-\\underline{p}erceptron-based\nm\\underline{ixer} (MLPixer) and \\underline{s}plash-and-\\underline{r}econstruct\n\\underline{b}lock (SRB). These architectures enhance global spatial ERF through\nall timesteps in early network stages of Transformer-based SNNs, improving\nperformance on challenging visual long-sequence modeling tasks. Extensive\nexperiments conducted on the Meta-SDT variants and across object detection and\nsemantic segmentation tasks further validate the effectiveness of our proposed\nmethod. Beyond these specific applications, we believe the proposed ST-ERF\nframework can provide valuable insights for designing and optimizing SNN\narchitectures across a broader range of tasks. The code is available at\n\\href{https://github.com/EricZhang1412/Spatial-temporal-ERF}{\\faGithub~EricZhang1412/Spatial-temporal-ERF}."}
