{"id": "2512.05240", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2512.05240", "abs": "https://arxiv.org/abs/2512.05240", "authors": ["Dmitrii Torbunov", "Onur Okuducu", "Yi Huang", "Odera Dim", "Rebecca Coles", "Yonggang Cui", "Yihui Ren"], "title": "IE2Video: Adapting Pretrained Diffusion Models for Event-Based Video Reconstruction", "comment": null, "summary": "Continuous video monitoring in surveillance, robotics, and wearable systems faces a fundamental power constraint: conventional RGB cameras consume substantial energy through fixed-rate capture. Event cameras offer sparse, motion-driven sensing with low power consumption, but produce asynchronous event streams rather than RGB video. We propose a hybrid capture paradigm that records sparse RGB keyframes alongside continuous event streams, then reconstructs full RGB video offline -- reducing capture power consumption while maintaining standard video output for downstream applications. We introduce the Image and Event to Video (IE2Video) task: reconstructing RGB video sequences from a single initial frame and subsequent event camera data. We investigate two architectural strategies: adapting an autoregressive model (HyperE2VID) for RGB generation, and injecting event representations into a pretrained text-to-video diffusion model (LTX) via learned encoders and low-rank adaptation. Our experiments demonstrate that the diffusion-based approach achieves 33\\% better perceptual quality than the autoregressive baseline (0.283 vs 0.422 LPIPS). We validate our approach across three event camera datasets (BS-ERGB, HS-ERGB far/close) at varying sequence lengths (32-128 frames), demonstrating robust cross-dataset generalization with strong performance on unseen capture configurations."}
{"id": "2512.05246", "categories": ["cs.NE", "cs.IT"], "pdf": "https://arxiv.org/pdf/2512.05246", "abs": "https://arxiv.org/abs/2512.05246", "authors": ["Ankit Gupta", "Onur Dizdar", "Yun Chen", "Fehmi Emre Kadan", "Ata Sattarzadeh", "Stephen Wang"], "title": "NeuromorphicRx: From Neural to Spiking Receiver", "comment": null, "summary": "In this work, we propose a novel energy-efficient spiking neural network (SNN)-based receiver for 5G-NR OFDM system, called neuromorphic receiver (NeuromorphicRx), replacing the channel estimation, equalization and symbol demapping blocks. We leverage domain knowledge to design the input with spiking encoding and propose a deep convolutional SNN with spike-element-wise residual connections. We integrate an SNN with artificial neural network (ANN) hybrid architecture to obtain soft outputs and employ surrogate gradient descent for training. We focus on generalization across diverse scenarios and robustness through quantized aware training. We focus on interpretability of NeuromorphicRx for 5G-NR signals and perform detailed ablation study for 5G-NR signals. Our extensive numerical simulations show that NeuromorphicRx is capable of achieving significant block error rate performance gain compared to 5G-NR receivers and similar performance compared to its ANN-based counterparts with 7.6x less energy consumption."}
{"id": "2512.05472", "categories": ["cs.NE"], "pdf": "https://arxiv.org/pdf/2512.05472", "abs": "https://arxiv.org/abs/2512.05472", "authors": ["Yiting Dong", "Zhaofei Yu", "Jianhao Ding", "Zijie Xu", "Tiejun Huang"], "title": "Unleashing Temporal Capacity of Spiking Neural Networks through Spatiotemporal Separation", "comment": null, "summary": "Spiking Neural Networks (SNNs) are considered naturally suited for temporal processing, with membrane potential propagation widely regarded as the core temporal modeling mechanism. However, existing research lack analysis of its actual contributions in complex temporal tasks. We design Non-Stateful (NS) models progressively removing membrane propagation to quantify its stage-wise role. Experiments reveal a counterintuitive phenomenon: moderate removal in shallow or deep layers improves performance, while excessive removal causes collapse. We attribute this to spatio-temporal resource competition where neurons encode both semantics and dynamics within limited range, with temporal state consuming capacity for spatial learning. Based on this, we propose Spatial-Temporal Separable Network (STSep), decoupling residual blocks into independent spatial and temporal branches. The spatial branch focuses on semantic extraction while the temporal branch captures motion through explicit temporal differences. Experiments on Something-Something V2, UCF101, and HMDB51 show STSep achieves superior performance, with retrieval task and attention analysis confirming focus on motion rather than static appearance. This work provides new perspectives on SNNs' temporal mechanisms and an effective solution for spatiotemporal modeling in video understanding."}
{"id": "2512.05906", "categories": ["cs.NE"], "pdf": "https://arxiv.org/pdf/2512.05906", "abs": "https://arxiv.org/abs/2512.05906", "authors": ["Lennart P. L. Landsmeer", "Amirreza Movahedin", "Said Hamdioui", "Christos Strydis"], "title": "EventQueues: Autodifferentiable spike event queues for brain simulation on AI accelerators", "comment": null, "summary": "Spiking neural networks (SNNs), central to computational neuroscience and neuromorphic machine learning (ML), require efficient simulation and gradient-based training. While AI accelerators offer promising speedups, gradient-based SNNs typically implement sparse spike events using dense, memory-heavy data-structures. Existing exact gradient methods lack generality, and current simulators often omit or inefficiently handle delayed spikes. We address this by deriving gradient computation through spike event queues, including delays, and implementing memory-efficient, gradient-enabled event queue structures. These are benchmarked across CPU, GPU, TPU, and LPU platforms. We find that queue design strongly shapes performance. CPUs, as expected, perform well with traditional tree-based or FIFO implementations, while GPUs excel with ring buffers for smaller simulations, yet under higher memory pressure prefer more sparse data-structures. TPUs seem to favor an implementation based on sorting intrinsics. Selective spike dropping provides a simple performance-accuracy trade-off, which could be enhanced by future autograd frameworks adapting diverging primal/tangent data-structures."}
