{"id": "2510.19560", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.19560", "abs": "https://arxiv.org/abs/2510.19560", "authors": ["Yao Deng", "Xian Zhong", "Wenxuan Liu", "Zhaofei Yu", "Jingling Yuan", "Tiejun Huang"], "title": "HAD: Hierarchical Asymmetric Distillation to Bridge Spatio-Temporal Gaps in Event-Based Object Tracking", "comment": null, "summary": "RGB cameras excel at capturing rich texture details with high spatial\nresolution, whereas event cameras offer exceptional temporal resolution and a\nhigh dynamic range (HDR). Leveraging their complementary strengths can\nsubstantially enhance object tracking under challenging conditions, such as\nhigh-speed motion, HDR environments, and dynamic background interference.\nHowever, a significant spatio-temporal asymmetry exists between these two\nmodalities due to their fundamentally different imaging mechanisms, hindering\neffective multi-modal integration. To address this issue, we propose\n{Hierarchical Asymmetric Distillation} (HAD), a multi-modal knowledge\ndistillation framework that explicitly models and mitigates spatio-temporal\nasymmetries. Specifically, HAD proposes a hierarchical alignment strategy that\nminimizes information loss while maintaining the student network's\ncomputational efficiency and parameter compactness. Extensive experiments\ndemonstrate that HAD consistently outperforms state-of-the-art methods, and\ncomprehensive ablation studies further validate the effectiveness and necessity\nof each designed component. The code will be released soon."}
{"id": "2510.19764", "categories": ["cs.NE"], "pdf": "https://arxiv.org/pdf/2510.19764", "abs": "https://arxiv.org/abs/2510.19764", "authors": ["James C. Knight", "Johanna Senk", "Thomas Nowotny"], "title": "A flexible framework for structural plasticity in GPU-accelerated sparse spiking neural networks", "comment": "22 pages, 9 figures, 2 tables", "summary": "The majority of research in both training Artificial Neural Networks (ANNs)\nand modeling learning in biological brains focuses on synaptic plasticity,\nwhere learning equates to changing the strength of existing connections.\nHowever, in biological brains, structural plasticity - where new connections\nare created and others removed - is also vital, not only for effective learning\nbut also for recovery from damage and optimal resource usage. Inspired by\nstructural plasticity, pruning is often used in machine learning to remove weak\nconnections from trained models to reduce the computational requirements of\ninference. However, the machine learning frameworks typically used for\nbackpropagation-based training of both ANNs and Spiking Neural Networks (SNNs)\nare optimized for dense connectivity, meaning that pruning does not help reduce\nthe training costs of ever-larger models. The GeNN simulator already supports\nefficient GPU-accelerated simulation of sparse SNNs for computational\nneuroscience and machine learning. Here, we present a new flexible framework\nfor implementing GPU-accelerated structural plasticity rules and demonstrate\nthis first using the e-prop supervised learning rule and DEEP R to train\nefficient, sparse SNN classifiers and then, in an unsupervised learning\ncontext, to learn topographic maps. Compared to baseline dense models, our\nsparse classifiers reduce training time by up to 10x while the DEEP R rewiring\nenables them to perform as well as the original models. We demonstrate\ntopographic map formation in faster-than-realtime simulations, provide insights\ninto the connectivity evolution, and measure simulation speed versus network\nsize. The proposed framework will enable further research into achieving and\nmaintaining sparsity in network structure and neural communication, as well as\nexploring the computational benefits of sparsity in a range of neuromorphic\napplications."}
