{"id": "2511.05467", "categories": ["cs.CV", "76T10, 68T07", "I.2.10; I.4.8; I.4.9"], "pdf": "https://arxiv.org/pdf/2511.05467", "abs": "https://arxiv.org/abs/2511.05467", "authors": ["Sanghyeon Chang", "Srikar Arani", "Nishant Sai Nuthalapati", "Youngjoon Suh", "Nicholas Choi", "Siavash Khodakarami", "Md Rakibul Hasan Roni", "Nenad Miljkovic", "Aparna Chandramowlishwaran", "Yoonjin Won"], "title": "EventFlow: Real-Time Neuromorphic Event-Driven Classification of Two-Phase Boiling Flow Regimes", "comment": "19 pages, 6 figures, Under review in Droplet (Manuscript ID:\n  DRO-2025-0045.R1)", "summary": "Flow boiling is an efficient heat transfer mechanism capable of dissipating\nhigh heat loads with minimal temperature variation, making it an ideal thermal\nmanagement method. However, sudden shifts between flow regimes can disrupt\nthermal performance and system reliability, highlighting the need for accurate\nand low-latency real-time monitoring. Conventional optical imaging methods are\nlimited by high computational demands and insufficient temporal resolution,\nmaking them inadequate for capturing transient flow behavior. To address this,\nwe propose a real-time framework based on signals from neuromorphic sensors for\nflow regime classification. Neuromorphic sensors detect changes in brightness\nat individual pixels, which typically correspond to motion at edges, enabling\nfast and efficient detection without full-frame reconstruction, providing\nevent-based information. We develop five classification models using both\ntraditional image data and event-based data, demonstrating that models\nleveraging event data outperform frame-based approaches due to their\nsensitivity to dynamic flow features. Among these models, the event-based long\nshort-term memory model provides the best balance between accuracy and speed,\nachieving 97.6% classification accuracy with a processing time of 0.28 ms. Our\nasynchronous processing pipeline supports continuous, low-latency predictions\nand delivers stable output through a majority voting mechanisms, enabling\nreliable real-time feedback for experimental control and intelligent thermal\nmanagement."}
{"id": "2511.05215", "categories": ["cs.NE", "cs.AR"], "pdf": "https://arxiv.org/pdf/2511.05215", "abs": "https://arxiv.org/abs/2511.05215", "authors": ["Varun Manjunath", "Pranav Ramesh", "Gopalakrishnan Srinivasan"], "title": "NeuroFlex: Column-Exact ANN-SNN Co-Execution Accelerator with Cost-Guided Scheduling", "comment": null, "summary": "NeuroFlex is a column-level accelerator that co-executes artificial and\nspiking neural networks to minimize energy-delay product on sparse edge\nworkloads with competitive accuracy. The design extends integer-exact QCFS\nANN-SNN conversion from layers to independent columns. It unifies INT8 storage\nwith on-the-fly spike generation using an offline cost model to assign columns\nto ANN or SNN cores and pack work across processing elements with deterministic\nruntime. Our cost-guided scheduling algorithm improves throughput by 16-19%\nover random mapping and lowers EDP by 57-67% versus a strong ANN-only baseline\nacross VGG-16, ResNet-34, GoogLeNet, and BERT models. NeuroFlex also delivers\nup to 2.5x speedup over LoAS and 2.51x energy reduction over SparTen. These\nresults indicate that fine-grained and integer-exact hybridization outperforms\nsingle-mode designs on energy and latency without sacrificing accuracy."}
