{"id": "2510.15542", "categories": ["cs.NE", "cs.LG", "q-bio.NC"], "pdf": "https://arxiv.org/pdf/2510.15542", "abs": "https://arxiv.org/abs/2510.15542", "authors": ["Ivan Kartashov", "Mariia Pushkareva", "Iakov Karandashev"], "title": "SpikeFit: Towards Optimal Deployment of Spiking Networks on Neuromorphic Hardware", "comment": "13 pages, 2 figures. Work in progress", "summary": "This paper introduces SpikeFit, a novel training method for Spiking Neural\nNetworks (SNNs) that enables efficient inference on neuromorphic hardware,\nconsidering all its stringent requirements: the number of neurons and synapses\nthat can fit on a single device, and lower bit-width representations (e.g.,\n4-bit, 8-bit). Unlike conventional compressing approaches that address only a\nsubset of these requirements (limited numerical precision and limited number of\nneurons in the network), SpikeFit treats the allowed weights' discrete values\nthemselves as learnable parameters co-optimized with the model, allowing for\noptimal Clusterization-Aware Training (CAT) of the model's weights at low\nprecision (2-, 4-, or 8-bit) which results in higher network compression\nefficiency, as well as limiting the number of unique synaptic connections to a\nvalue required by neuromorphic processor. This joint optimization allows\nSpikeFit to find a discrete weight set aligned with hardware constraints,\nenabling the most complete deployment across a broader range of neuromorphic\nprocessors than existing methods of SNN compression support. Moreover, SpikeFit\nintroduces a new hardware-friendly Fisher Spike Contribution (FSC) pruning\nmethod showing the state-of-the-art performance. We demonstrate that for\nspiking neural networks constrained to only four unique synaptic weight values\n(M = 4), our SpikeFit method not only outperforms state-of-the-art SNNs\ncompression methods and conventional baselines combining extreme quantization\nschemes and clustering algorithms, but also meets a wider range of neuromorphic\nhardware requirements and provides the lowest energy use in experiments."}
