{"id": "2602.06766", "categories": ["cs.NE"], "pdf": "https://arxiv.org/pdf/2602.06766", "abs": "https://arxiv.org/abs/2602.06766", "authors": ["Eleonora Cicciarella", "Riccardo Mazzieri", "Jacopo Pegoraro", "Michele Rossi"], "title": "Sparse Spike Encoding of Channel Responses for Energy Efficient Human Activity Recognition", "comment": "6 pages, 3 figures. Accepted for publication in IEEE International Conference on Communications (ICC) 2026", "summary": "ISAC enables pervasive monitoring, but modern sensing algorithms are often too complex for energy-constrained edge devices. This motivates the development of learning techniques that balance accuracy performance and energy efficiency. Spiking Neural Networks (SNNs) are a promising alternative, processing information as sparse binary spike trains and potentially reducing energy consumption by orders of magnitude. In this work, we propose a spiking convolutional autoencoder (SCAE) that learns tailored spike-encoded representations of channel impulse responses (CIR), jointly trained with an SNN for human activity recognition (HAR), thereby eliminating the need for Doppler domain preprocessing. The results show that our SCAE-SNN achieves F1 scores comparable to a hybrid approach (almost 96%), while producing substantially sparser spike encoding (81.1% sparsity). We also show that encoding CIR data prior to classification improves both HAR accuracy and efficiency. The code is available at https://github.com/ele-ciccia/SCAE-SNN-HAR."}
{"id": "2602.06405", "categories": ["cs.CV", "cs.NE"], "pdf": "https://arxiv.org/pdf/2602.06405", "abs": "https://arxiv.org/abs/2602.06405", "authors": ["Adam D. Hines", "Karin Nordström", "Andrew B. Barron"], "title": "A neuromorphic model of the insect visual system for natural image processing", "comment": "21 pages, 7 figures, under review", "summary": "Insect vision supports complex behaviors including associative learning, navigation, and object detection, and has long motivated computational models for understanding biological visual processing. However, many contemporary models prioritize task performance while neglecting biologically grounded processing pathways. Here, we introduce a bio-inspired vision model that captures principles of the insect visual system to transform dense visual input into sparse, discriminative codes. The model is trained using a fully self-supervised contrastive objective, enabling representation learning without labeled data and supporting reuse across tasks without reliance on domain-specific classifiers. We evaluated the resulting representations on flower recognition tasks and natural image benchmarks. The model consistently produced reliable sparse codes that distinguish visually similar inputs. To support different modelling and deployment uses, we have implemented the model as both an artificial neural network and a spiking neural network. In a simulated localization setting, our approach outperformed a simple image downsampling comparison baseline, highlighting the functional benefit of incorporating neuromorphic visual processing pathways. Collectively, these results advance insect computational modelling by providing a generalizable bio-inspired vision model capable of sparse computation across diverse tasks."}
{"id": "2602.06405", "categories": ["cs.CV", "cs.NE"], "pdf": "https://arxiv.org/pdf/2602.06405", "abs": "https://arxiv.org/abs/2602.06405", "authors": ["Adam D. Hines", "Karin Nordström", "Andrew B. Barron"], "title": "A neuromorphic model of the insect visual system for natural image processing", "comment": "21 pages, 7 figures, under review", "summary": "Insect vision supports complex behaviors including associative learning, navigation, and object detection, and has long motivated computational models for understanding biological visual processing. However, many contemporary models prioritize task performance while neglecting biologically grounded processing pathways. Here, we introduce a bio-inspired vision model that captures principles of the insect visual system to transform dense visual input into sparse, discriminative codes. The model is trained using a fully self-supervised contrastive objective, enabling representation learning without labeled data and supporting reuse across tasks without reliance on domain-specific classifiers. We evaluated the resulting representations on flower recognition tasks and natural image benchmarks. The model consistently produced reliable sparse codes that distinguish visually similar inputs. To support different modelling and deployment uses, we have implemented the model as both an artificial neural network and a spiking neural network. In a simulated localization setting, our approach outperformed a simple image downsampling comparison baseline, highlighting the functional benefit of incorporating neuromorphic visual processing pathways. Collectively, these results advance insect computational modelling by providing a generalizable bio-inspired vision model capable of sparse computation across diverse tasks."}
